[
  "Trump is fighting those efforts.",
  "David, you  wrote last week  about how President Trump is losing what you called the “battle for public opinion.” Should we be paying attention to that this early in the process?",
  "“The Russians have come to the conclusion that, so long as President Trump is in office, U.S.-Russian relations will remain at a standstill,” Mr.",
  "Trump is unwilling to accept anything less than the $5 billion he has requested for wall construction.",
  "Trump is next expected to meet President Xi Jinping of China in person, in November at the Asia-Pacific Economic Cooperation meetings in Santiago, Chile, Mr.",
  "Trump is virtually certain to appeal the ruling, either to the full Court of Appeals or to the Supreme Court.",
  "“Mr. Trump is unashamed of his corruption,” said Representative Lois Frankel, Democrat of Florida, said in a statement Friday. “He is abusing the office of the presidency and violating law by directing millions of dollars of American and foreign money to his family enterprises by holding an important meeting of world leaders at his Doral resort.”",
  "Trump is in a box on health care, the issue that registers as a top priority for voters in poll after poll.",
  "Trump is facing impeachment and a tough 2020 re-election campaign.",
  "Trump is violating the Constitution  by accepting payments from foreign governments.",
  "Trump is also escalating his trade fight on other fronts, including slapping higher tariffs on Turkey and preparing to tax $7.5 billion worth of wine, cheese, aircraft and other European goods on Friday.",
  "Trump is talking in authentic and admirably frank terms about a reality many Americans and Washington policymakers never confront.",
  "The troop withdrawal in Syria is likely to be a topic of conversation this weekend at the Values Voter Summit in Washington, where President Trump is scheduled to speak to hundreds of conservative leaders.",
  "Trump is vastly outspending Democrats on Facebook.",
  "Trump is due to travel to New York City this weekend for an event at Madison Square Garden, the rare instance of him visiting when he has no fund-raiser or official event scheduled.",
  "Trump is not going to be convicted by the Senate.",
  "Trump is expected to finalize his refugee cap in the coming days, which will pair with a potentially divisive executive order that gives local activists more power to reject refugees chosen for resettlement in their communities.",
  "Trump is violating the Constitution’s emoluments clauses by continuing to own, through a trust, the collection of hotels, golf courses and resorts that at times are taking payments from foreign government officials and the United States government.",
  "Trump is eager to change the conversation away from an impeachment inquiry and a rapidly widening series of questions about his team’s involvement in Ukraine.",
  "Trump is using to keep Mr.",
  "Trump is not assured of a second victory in Texas, which he carried in 2016 by 9 percentage points, the smallest margin for a Republican presidential candidate in the state since 1996.",
  "“There is no question whatsoever that Mr. Trump is more of a liability to the Republican Party than an asset,” said Mark Jones, professor of political science at the Baker Institute at Rice University. “Over all, you can say he represents a drag on the Republican ticket.”",
  "“In these suburban areas, where we saw Democrats take seats from Republicans in the 2018 election, Trump is a problem.”",
  "Trump is likely to remain the primary means of communication as the impeachment fight intensifies.",
  "Trump is particularly focused on the source of the information the whistle-blower disclosed and the fact that the whistle-blower’s most serious allegations were not witnessed firsthand.",
  "Trump is the remotest of hypotheticals, since it would first require the Senate to vote to impeach and remove him.",
  "“We don’t know whether President Trump is going to be impeached but the allegations are as serious as it gets: endangering national security for political gain,” Representative Jim McGovern of Massachusetts, the chairman of the House Rules Committee, thundered from the House floor, adding, “History is testing us.”",
  "Trump is impeached, he will almost certainly be acquitted by a Republican-led Senate.",
  "They came up with a new framework for defining their approach: “Watch what they do, not what they say.” Trump is rarely quoted or shown onscreen; instead, she interprets his actions.",
  "(Betwixt them is a scene of sordid copulation: No matter where you stand in the cable-news wars, Trump is a lucrative story.)",
  "Trump is not improving.",
  "“Trump is trying really hard to avoid slapping sanctions on Turkey, and that’s partly because he’s trying to not rupture his relationship with Erdogan,” said Soner Cagaptay, the director of the Turkish Research Program at the Washington Institute for Near East Policy.",
  "Trump is correct that nations like Belgium, Britain, France and Germany have been largely content to let the Kurds bear the burden of detaining their citizens —   particularly the male fighters.",
  "WASHINGTON — President Trump is leaning in favor of a new Pentagon plan to keep a small contingent of American troops in eastern Syria, perhaps numbering about 200, to combat the Islamic State and block the advance of Syrian government and Russian forces into the region’s coveted oil fields, a senior administration official said on Sunday.",
  "Trump is squandering American power and influence in the world with little to show for it.",
  "Trump is  drawing down American forces anyway , pulling out 2,000 troops in the last year, leaving   12,000 to 13,000 .",
  "“Trump is a win-lose negotiator,” said  Wendy R. Sherman , a former under secretary of state under Mr. Obama who helped broker the  2015  nuclear agreement with Iran that Mr. Trump abandoned  last year . “That’s what he did as a real estate developer. He doesn’t see the larger landscape, the interconnections, the larger costs, the loss of greater benefits.”",
  "Trump is likely to be impeached.",
  "Trump is impeached by the House, it will be in part because of some of the same career professionals he has derided as  “absolute scum”  or  compared to Nazis .",
  "“There’s an algorithmic bias that inherently benefits hate and negativity and anger,” said Shomik Dutta, a digital strategist and a founder of Higher Ground Labs, an incubator for Democratic start-ups. “If anger has an algorithmic bias, then Donald Trump is the captain of that ship.”",
  "“Trump is using Twitter, and then this controversy, to amplify this story rather than the story about his impending impeachment,” she said. “And so the pile-on and the echo effect that you see around Trump’s tweets distract, I think, from a real constitutional crisis in the country.”",
  "Trump is facing an impeachment inquiry in the House because of his request to the Ukrainian government that it look into what Mr.",
  "Trump is eager to get the news out, the official said, and Mr.",
  "“There’s a growing sense that Trump is backing away from his commitments to allies,” said Emily B. Landau, an arms-control expert at the Institute for National Security Studies in Tel Aviv. “I’m not sure Israel’s in the same category as Saudi Arabia and the Kurds. At least I’m hoping that we’re not in the same category. But expectations were forged through Trump’s rhetoric and his behavior, and some of his policy decisions. And the question is, to what degree will he follow through with it, if Israel really needs the United States?”",
  "Trump is not so much ending wars, as he is moving troops from one conflict to another.",
  "Trump is also said to be  in favor of leaving about 200 Special Operation forces  in eastern Syria to help combat Islamic State guerrilla fighters and to block Syrian government forces and their Russian advisers from seizing several coveted oil fields in the east.",
  "Trump is generally an “honest” person has spiked since March, when Quinnipiac last asked the question: from 66 percent then to 83 percent today.",
  "Trump is obstructing Congress and should be held in contempt.",
  "Trump is legally obligated  by a 2017 law  to go further and enact sanctions.",
  "WASHINGTON — Nearly a year before the 2020 election, President Trump is running out of options in his search for a leader for the Department of Homeland Security who could win Senate confirmation or even serve in an acting capacity — and still carry out the president’s immigration crackdown.",
  "Trump is  locked in a legal battle  with Congress, where House Democrats have sought to obtain six years’ worth of his personal and business tax returns.",
  "President Trump is nearing a milestone in his push to overhaul the federal judiciary with conservative judges.",
  "WASHINGTON — President Trump is once again pursuing a national security strategy at odds with the official position of his government, ordering a pullback of American forces just inside the Syrian border.",
  "Trump is so suspicious of the professional staff — many drawn from the State Department and the C.I.A.",
  "Trump is considering a presidential pardon for Mr.",
  "Trump is “desperately clutching for conspiracy theories that have been debunked and dismissed by independent, credible news organizations,” Kate Bedingfield, Mr.",
  "“I hope President Trump is right in his belief that Turkey’s invasion of Syria is of no concern to us, abandoning the Kurds won’t come back to haunt us, ISIS won’t reemerge, and Iran will not fill the vacuum created by this decision,”  Mr.",
  "In effect, President Trump is making the sweeping assertion that he can ignore Congress as it weighs his fate because he considers the impeachment effort unfair and the Democrats who initiated it biased against him, an argument that channeled his anger even as it failed to pass muster with many scholars on Wednesday.",
  "Trump is employing a version of Mr.",
  "Trump is doing now.",
  "Trump is taking Mr.",
  "“Not surprisingly, President Trump is adopting a take-no-prisoners approach to this new threat that presents itself to his presidency, just has he has done, often with great success, when previous threats have presented themselves,” added Mr.",
  "But when Trump is making these decisions, I just realized it would be bad for my son-in-law and my grandchildren,” she said.",
  "On Tuesday morning, Representative Matt Gaetz of Florida, a close Trump ally, tweeted: “Donald Trump is innocent.",
  "“Donald Trump is pouring gasoline on the fire and leaving a lot of us very confused.”",
  "law on his own, Trump is trying to find end runs around Congress and the legislative process to impose his will by fiat,” said Julie Dinnerstein, an immigration lawyer with CUNY Citizenship NOW, which provides free legal services to the public.",
  "Trump is among the best known of the quartet of high-profile Trump campaign stars looking to build support among women.",
  "“Polls clearly and consistently show that Trump is in terrible shape with women, particularly with college-educated women and younger women, but not only with them,” Mr. Garin said, suggesting that the campaign’s statements to the contrary are simply wishful thinking. “While Trump brags on how well women are doing in the economy today, polls show that women voters are the least likely to feel that they have benefited from Trump’s economic policies.”",
  "Trump is surrounded by advisers less willing to stand up to him, his threat to seal off the country from a flood of immigrants remains active.",
  "While President Trump is bracing for an impeachment fight in Washington, back home in New York, his friends and allies are grappling with challenges of their own.",
  "Trump is speaking.",
  "In the second photograph, President Trump is dressed in a tailored suit and baby blue tie, staring directly at the camera from his seat at the middle of the table in the Situation Room.",
  "Trump is Vice President Mike Pence.",
  "Trump is seen in the Situation Room’s main conference room, where the president typically works.",
  "In this account, Trump is as he ever was: craven, feckless, moody, narcissistic, mendacious, forgetful.",
  "“Donald Trump is trying to interfere in Britain’s election to get his friend Boris Johnson elected,” the Labour Party leader, Jeremy Corbyn,  said on Twitter .",
  "Trump is willing to brook some difference of opinion.",
  "Trump is less likely to be angered by criticism of his foreign policy, many Republicans believe their constituents will be as well.",
  "Trump is under as he and his lawyers try to devise a strategy for keeping him in office.",
  "Trump is also set to meet with Mr.",
  "Trump is using the Justice Department to go after his perceived enemies.",
  "Trump is certain to see the criminal investigation as a vindication of the years he and his allies have spent trying to discredit the Russia investigation.",
  "Trump is widely expected to delay the tariffs for several months, because there is little appetite in the administration to move ahead with them now, according to people familiar with the deliberations.",
  "Trump is popular in those places.",
  "Trump is from New York but no longer of it.",
  "WASHINGTON — For once, President Trump is showing no hard feelings.",
  "Trump is no stranger to fight nights.",
  "Trump is folding to China.",
  "Trump is using authority granted under  Section 301 of the Trade Act of 1974  for potential retaliatory tariffs.",
  "Trump is seeking to halt disclosures of his financial records by his accounting firm, Mazars USA.",
  "“Donald Trump is a big reason” for the two groups to now work together, said Jon Soltz, an Army veteran who served two tours in Iraq before helping found VoteVets, which struggled to build support for its antiwar agenda in its early years, even among Democrats. “He stood up and beat Jeb Bush by saying the Iraq war was a total joke. I don’t like him. He blocked us on Twitter, and we are going to work to beat him in 2020. But you can’t deny that Donald Trump trashing these wars was a game-changer for us all.”",
  "“We’re waging war against the most destructive  fires  in our state’s history, and Trump is conducting a full-on assault against the antidote,” Gov.",
  "“ If you’re going to Washington, you need to do something,” he said. “If the only thing you’re going to do the whole time you’re there is try to get rid of the president, that’s a problem. I mean, Trump is not a great person, but you’ve got to get some work done.”",
  "Trump is “an egotistical, overbearing man,” she said —  but said that doesn’t change what he’s achieved.",
  "Trump is deeply unpopular in the city and his visits are often met with  protests.",
  "Trump is now in a fight with the Manhattan district attorney over a  subpoena for his personal and business tax records .",
  "Trump is trying to fend off an impeachment inquiry into accusations that he solicited a foreign leader’s help in digging up dirt on a political rival.",
  "Trump is gone from office.",
  "President Trump is polarizing, often intentionally, as when he calls his opponents “ human scum .” We need a respite from such divisiveness.",
  "Trump is off by a lot.",
  "Trump is correct that since he took office, the United States has added more than 10,000 new manufacturing establishments, as measured by the Quarterly Census of Employment and Wages.",
  "Trump is innocent.",
  "Trump is not alone in leaving.",
  "Trump is also said to be angered by a subpoena filed by Cyrus R.",
  "Trump is heading into a re-election campaign as the American economy begins to slow and as key political constituencies, like farmers and manufacturers, continue to suffer from lost sales to China.",
  "Trump is trying to strike a trade deal with China, one of the central goals of his presidency.",
  "Trump is facing a Dec.",
  "“President Trump is always going to look for opportunities to bring our troops home and to take these men and women out of harm’s way,” Mr.",
  "“We are no longer interested in such talks that bring nothing to us,” Kim Kye-gwan said. “As we have got nothing in return, we will no longer gift the U.S. president with something he can boast of, but get compensation for the successes that President Trump is proud of as his administrative achievements.”",
  "“Democrats want to impeach President Trump because unelected and anonymous bureaucrats disagreed with the president’s decisions and were discomforted by his telephone call with President Zelensky,” the memo’s author’s wrote. “The president works for the American people. And President Trump is doing what Americans elected him to do.”",
  "Trump is undermining Christianity in the same way he has damaged the Republican Party.",
  "In Washington, the impeachment inquiry of President Trump is Topic A, B and C.",
  "Trump is blocking lawmakers’ access to documents and witnesses.",
  "“Democracy dies when there is no support for democracy, when people don’t believe in it,” she said. “Here, Trump is meeting with resistance by institutions at every step.”",
  "“Donald Trump is not simply a serial liar; he is attempting to murder the very idea of truth, which is even worse,” said Peter Wehner, a former strategic adviser to President George W. Bush and an outspoken critic of Mr. Trump. “Because without truth, a free society cannot operate.”",
  "Trump is known for his insistence on placing the family surname on his properties, the Trump Organization has recently begun  removing the moniker  from some New York properties.",
  "Trump is also facing a defamation suit filed against him on Monday by  the journalist E.",
  "“Having that tweet from Donald Trump is going to be very, very important, promoting the book,” said Bakari Sellers, the former South Carolina state legislator who ran unsuccessfully for lieutenant governor and is now a CNN commentator. “She got what she wanted.”",
  "“Donald Trump is going to be a footnote in her political career,” Mr. Sellers predicted. “It won’t be defining.”",
  "Trump is expected in London for a meeting of NATO leaders in early December, just a few days before Britons go to the polls.",
  "“Generally speaking, foreign leaders don’t play a role in British elections,” said Timothy Bale, a professor of politics at Queen Mary University in London. “But Donald Trump is so exceptional. We hear and see so much about him that he has almost become a presence in domestic British politics.”",
  "“I don’t know how successful Corbyn will be in associating Boris with Trump — or even how damaging it would be to the Conservatives,” said Peter Westmacott, a former British ambassador to the United States. “Remember, Trump is still a good deal less unpopular in the U.K. than in other European countries, except perhaps Poland and Hungary.”",
  "Trump is striking for a noncandidate whose most significant claim to fame remains his parentage, and who has sought to  deflect criticism of his  recent attacks on impeachment witnesses by asserting that he is merely a “private citizen.” And it underscores the unusual cross-pollination between the Trump family’s political ambitions, its business ventures and the party President Trump now leads.",
  "Trump is being accused in court of exceeding his power on policy decisions and defying the law on personal matters.",
  "Trump is fighting claims that he violated the Constitution’s emoluments clause barring self-enrichment.",
  "“Where things seem most different is that Trump is more willing than other presidents to take the fight to the opposition in court,” he said. “At least where his own interests are at stake, he is not afraid to look to the courts for relief. These suits may have political benefits for the president, but they also tend to increase the daily unpredictability in the conduct of government business.”",
  "Trump is aware of the politics and how poorly it may play out for him if young immigrants are facing deportation before the 2020 election, according to people close to the White House.",
  "“Among Republican voters, Trump is still a magic name,” Mr. King said in a telephone interview. “I’ve been with Don Jr. several times on Long Island. Was with Lara once at a fund-raising event. She handles herself very well. She’s good with people.”",
  "Trump is a fill-in for his lack of policy details beyond the general talk of cuts.",
  "Trump is a turnout tool that works both ways.",
  "— Anna Schroeder was making dinner in her Hinsdale home  in this stretch of the Chicago suburbs  this year when her 8-year-old son interrupted to ask a question about the impeachment news blaring in the background: Does this mean President Trump is a bad guy?",
  "Trump is not the first commander in chief to wield the power of clemency in a polarizing way.",
  "“Why the left is triggered by Trump is because they understand they’re in a Kafkaesque nightmare, that Donald Trump is going to be in their personal lives 10, 20 and 30 years from now — and the reason is Don McGahn,” Bannon said.",
  "“Well, it’s been nearly three years, and I can tell you one thing for certain,” he continued. “Donald Trump is one of the most anti-worker presidents in American history.”",
  "Trump is winning despite losing.",
  "Trump is casting as a  test of his strength  as he faces impeachment by House Democrats in Washington.",
  "Trump is seeking to influence.",
  "Trump is weaker here than he was three years ago.",
  "“Bevin is not Trump,” she said. “When you insult everyday Kentuckians and they’re your neighbors it’s different. Trump is not your governor.”",
  "“It’s going to drive a lot of things underground that Trump is never going to hear about,” he said. “And I think the senior commanders within the services are just going to hide things from him. Or they may elect to not even take action.”",
  "Trump is trying to create an impression of invincibility, it could ultimately hurt his re-election.",
  "Trump is guilty of an abuse of power that Republicans are ignoring.",
  "“Trump is replacing formal relations among nations in several cases with family-to-family relationship, or crony-to-crony relationships,” said Eric S.",
  "Trump is a fierce nationalist who has often denigrated Muslims and especially political Islamists.",
  "Trump is in office and effectively make the G.O.P.",
  "Trump is not the legitimate president and set out to sabotage his duly elected government.",
  "“It is quite unusual for a White House to eat its young,” he said. “But Trump is a president who seems unable to tolerate dissent.”",
  "“I don’t believe that Donald Trump is a land-for-peace person.",
  "While President Trump is just the fourth commander in chief in American history  to confront a serious threat of impeachment , the prospect hung over many of his predecessors, a nagging worry in the back of the mind for some, a constitutional sword of Damocles for others.",
  "Trump is not nearly so comfortable that he could be considered  a sure thing .",
  "“Donald Trump is going to be impeached whether it is by the ballot box or Congress,”  Mr. Swalwell said this year.  “It will just be a matter of which one comes first.”",
  "“Adam has one of the better styles for the Trump era in that he manages to be in charge of his own narrative rather than permitting Trump to set the terms of the debate,” says Ben Rhodes, a deputy national security adviser under President Barack Obama who became friendly with Schiff when he worked in the White House. “You contrast that with Mueller, who said nothing publicly, and it hurt him badly because Trump is constantly setting the terms of public perception. And you contrast that with people who chase every tweet Trump sends and get in a back and forth. Schiff engages on his own terms while not allowing Trump to suck up all the oxygen.”",
  "Trump is not on the ballot, but he loomed large behind almost every conversation with voters in recent days, even as they spoke of gun violence, health care and more local issues like the condition of roads.",
  "“I think Republicans have gotten themselves around that. Trump is Trump. They’ve come to accept that.”",
  "Trump is locked in a protracted legal battle with Congress over the release of his tax returns.",
  "Trump is trying to block a subpoena from Manhattan prosecutors that would require his accounting firm to turn over eight years of his personal and corporate tax returns.",
  "Trump is immune from all criminal proceedings while he is in office, they added that investigations by state prosecutors are particularly problematic.",
  "Trump is scheduled to hold a joint news conference with Mr.",
  "Trump is heading to London again next week, this time for a NATO summit marking the alliance’s 70th anniversary.",
  "Trump is able to heed the “stay away” signals Mr.",
  "Trump is scheduled to participate in a working lunch with representatives of Estonia, Greece, Latvia, Poland, Romania, Lithuania, Bulgaria and Britain.",
  "Trump is innocent or guilty, in which case he would be removed.",
  "Trump is to remind voters that they will have a say about his fate in less than a year, and that regardless of what happens in the Democratic-controlled House, the chances of the Republican Senate removing him from office are remote.",
  "Trump is in Germany.",
  "Trump is fit for office.",
  "A programming note: The first public hearing in the impeachment inquiry of President Trump is scheduled to begin at 10 a.m.",
  "Trump is expected to make an official policy announcement on Friday about progress toward a trade deal he initially announced in October.",
  "Trump is widely expected to be acquitted.",
  "Trump is only the third president to face a Senate trial for “high crimes and misdemeanors.” (The first two, Andrew Johnson and Bill Clinton, were both acquitted.",
  "Trump is unique in his zest for flouting the norms of presidential behavior.",
  "Trump is set to sign on Friday does, however, have language  strengthening reporting requirements  if the money is not obligated by budget officials within 90 days.",
  "Trump is expected to back a plan that would make permanent the individual tax cuts included in the tax package he signed in 2017.",
  "Trump is hoping his economic message wins out over impeachment, an issue campaign advisers predicted would be firmly in the rearview mirror by November.",
  "Trump is to invite the president’s wrath, ostracism within the party and a premature end to a career in Republican politics.",
  "“Trump is emotionally, intellectually and psychologically unfit for office, and I’m sure a lot of Republicans feel the same way,” Mr. Trott said. “But if they say that, the social media barrage will be overwhelming.”",
  "Trump is that all politics is personal with him, and he carefully tracks who on television is praising him or denouncing his latest rhetorical excess.",
  "I could not in good conscience vote against impeachment because I believe President Trump is guilty of wrongdoing,” she said.",
  "“I would remind the gentleman if President Trump is impeached and removed, the new president would be Mike Pence, not Hillary Clinton.”",
  "“President Trump is keeping his campaign promises and you hate him for that,” said Representative Glenn Grothman, Republican of Wisconsin.",
  "Trump is almost certain to move quickly to sign the defense bill, which authorizes a 3 percent pay raise for the troops and creates funding for a new space force, a high priority of the president.",
  "Trump is likely to reach a similar outcome, but it could do so much more quickly, with some Senate Republicans discussing the possibility that the case could be resolved in little more than a week.",
  "“Say goodbye to your majority,” Mr. Buck said. “And please join us in January of 2021 when President Trump is inaugurated again.”",
  "Trump is so eager for the public vindication of a Senate acquittal that he will put pressure on the majority leader to make it happen even if it means offering some concessions to Mr.",
  "Trump is doing in office, including half who strongly approves.",
  "“Trump is as big a motivator for our base as he is for his own base,” he said.",
  "“That narrative of ‘Trump is definitely going to want to move toward resolution because 2020 is 12 months away’ is being questioned,” said Michael Purves, the chief executive at Tallbacken Capital Advisors, a market strategy and research firm.",
  "Trump is refusing to engage in the impeachment process, and Democrats have concluded that they will press ahead anyway, rendering a historic undertaking little more than a foregone conclusion.",
  "Trump is being given ample opportunities to defend himself and that the White House would not have blocked Mr.",
  "“Yet Trump is treading a politically delicate path  as he tries to help Big Tech improve its access to foreign markets at a time when the sector is increasingly becoming a punching bag in Washington,” Mr.",
  "(Mr. Trump is a character of sorts on the show, albeit offstage.)",
  "Trump is something else entirely, Mr.",
  "“The problem with Trump is that his fiction is all-enveloping,” he went on. “Reality — his own extreme reality — is whatever he needs it to be. The fiction, the story he’s telling, never stops.”",
  "Trump is not so much ending wars as he is moving troops from one conflict to another, and Mr.",
  "“Loyalty to Trump is what I think it stands for,” she said.",
  "Trump is likely to be competitive in November, is just one piece of an advertising campaign that is unrivaled in scope and scale.",
  "“I’ve been telling anyone who will listen, Trump is winning,” said Kevin Sheekey, the campaign manager for Mr.",
  "Trump is showing little appetite for a return to the “fire and fury” tensions of two years ago.",
  "Trump is the first president to avoid doing so in decades.",
  "Trump is the first president to be sued for violating those clauses, and so far only lower courts or appellate panels have ruled on the three cases against him.",
  "WASHINGTON — President Trump is discussing with his advisers the possibility of sitting out the general election debates in 2020 because of his misgivings about the commission that oversees them, according to two people familiar with the discussions.",
  "“because I believe President Trump is guilty of wrongdoing.”",
  "Trump is the most polarizing president in modern history, playing to racial, ideological and economic rifts rather than seeking to heal them.",
  "Trump is expected to face a trial early next year in the Senate, where his acquittal in the Republican-controlled chamber appears likely.",
  "“Trump is a master of casting, and Gallagher is a perfect fit,” said Mr. Rieckhoff, who now hosts the “ Angry Americans ” podcast. “He’s handsome, he’s heroic, he’s got a beautiful wife. He’s a Rambo version of the same story Trump has been telling over and over: The deep state is trying to screw you, the media is bad, and the rich people don’t understand you. But I’ll stick up for you.”",
  "“I love when I wake up in the morning and Donald Trump is president.”",
  "One of the biggest divides in the race for the Democratic presidential nomination is whether Donald Trump is a cause or a symptom of the current dysfunction in American politics.",
  "Trump is doing in office, including half who strongly approve.",
  "“That’s perhaps what Trump is hearing.",
  "Trump is re-elected.",
  "“What the Saudis didn’t understand,” Dr. Cook said, “was that Donald Trump is a lot closer to Barack Obama’s worldview than they realized. It’s about getting out of the Middle East.”",
  "Trump is said to have talked with several prominent lawyers about taking on his case, but multiple people said that Mr.",
  "“Trump is incapable of impulse control,” said Douglas B.",
  "Trump is also said to have suggested to aides that he would like to campaign with the three men.",
  "White House aides said President Trump is still standing by his embattled administrator of the Centers for Medicare and Medicaid Services, Seema Verma, amid reports that she had requested that taxpayers reimburse her $47,000 for property stolen on a trip, including jewelry priced at more than $40,000.",
  "Trump is not expected to attend Thursday’s session, the official said, but he could stop by.",
  "Trump is hoping to claim as significant accomplishments.",
  "Trump is on the defensive himself, facing damaging revelations from the impeachment proceedings.",
  "Trump is attacking the former vice president because he fears him as a potential opponent.",
  "Trump is accused of and only occasionally challenging Mr.",
  "Trump is such a radioactive figure in Britain that the Conservatives feared his public endorsement would backfire on the prime minister.",
  "Trump is likely to use a variation on the people vs.",
  "Trump is only the third president to be impeached — the process to determine the shape of the trial is one of malleable rules and negotiations.",
  "Trump is comfortable as he heads into the 2020 re-election campaign, and he is likely to divide duties with one of his successors, Nick Luna.",
  "Bowman,  a law professor at the University of Missouri and the author of “High Crimes and Misdemeanors: A History of Impeachment for the Age of Trump,” said “the technical argument that Trump is not really and truly ‘impeached’ without transmission of the articles is unconvincing to me.",
  "Trump is a prisoner  in her own home.",
  "Trump is complicit, clueless, estranged from her husband, advises her husband, loves Washington, hates Washington, just wants to be left alone.",
  "“Trump is in an awkward position right now,” said  Lewis A. Lukens , who served as acting ambassador to Britain in the first months of the Trump presidency. “His instincts are to pull Johnson close, but he will have been told by his team that any intervention would be counterproductive.”",
  "Trump is finding that he has to recalibrate his approach.",
  "Trump is scheduled to meet Ms.",
  "An unskilled bluffer, Trump is instinctively wary of real confrontation, knowing as he does that he is president of a country that has been baffled by protracted wars and is not keen to engage in more.",
  "“The curse of Donald Trump is that he can’t help himself, and he always makes it about him,” Mr.",
  "Trump is not prone to contemplation.",
  "Impeachment of Donald Trump is a necessity.",
  "“That’s perhaps what Trump is hearing.",
  "Trump is known for trying to build personal relationships with his counterparts, but he also has a penchant for public feuds, fueled in part by his off-the-cuff approach to the news media and his regular Twitter rants.",
  "Trump is fiercely protective of her own son, Barron, who is three years younger than Ms.",
  "Trump is more than just a political battle in Washington.",
  "But in a finding that President Trump is certain to seize on, the report documented a pattern of omissions, errors and inconsistencies in the bureau’s  applications for warrants  to eavesdrop on Carter Page, a former Trump campaign aide.",
  "Now President Trump is on that list.",
  "It’s not as if President Trump is completely lacking in Christmas spirit, though.",
  "In contrast, Melania Trump is such a  Sphinx-like  creature that, for a while, many wondered if she even lived in the White House.",
  "Trump is trying to replace NAFTA with a deal of his own, known as the United States-Mexico-Canada Agreement, that includes many provisions that Democrats have long pushed for, including a demand that Mexico raise its minimum wage and a stipulation that cars include a higher percentage of parts made in North America.",
  "Trump is hardly the first dissembler in the White House.",
  "President Trump is taking on Americans’ flushing habits and the country’s water efficiency standards.",
  "Trump is purely political and unsupported by the evidence.",
  "Trump is being railroaded and that Democrats are simply intent on undoing a 2016 election result they found reprehensible.",
  "Trump is simply refusing to engage.",
  "“The fact is that the House Democrats are essentially giving Trump the same process as previous presidents have received, and it’s Trump who is trying to throw out the rule book” and attack the process at every turn, he said. “Our founders put impeachment in the Constitution as a critical safeguard for the people, and what Trump is trying to do with these baseless attacks is read the impeachment clauses out of the Constitution.”",
  "Trump is almost certain to invite a court battle.",
  "Trump is expected to address a largely friendly audience on Monday at the American Farm Bureau’s annual convention.",
  "“President Trump is going to use the public airwaves to spread fear and misinformation tonight,” tweeted Representative David Cicilline of Rhode Island, the head of the Democrats’ messaging arm. “I’m going to correct the record.”",
  "“Listen, we need security and a wall will provide that security,” said Mr. Johnson, 43, whose family-owned onion and chile farm sits along a stretch of the border. “I’m 100 percent for the wall. Trump is bold in pushing for it.”",
  "“This isn’t a deal,” Mr. Ramos said. “Trump is just offering to give back what he already took away.”",
  "Trump is eager to deliver his State of the Union address in the House chamber next week as originally scheduled, the most prominent platform a president has to set the terms for the coming year.",
  "Trump is keeping up blame game.",
  "Trump is rewriting the premise of his central campaign promise, a pledge that he  has repeated hundreds of times  and has said would be “ so easy ” to fulfill.",
  "Trump is “as isolated as any public figure could conceivably be,” and added that Mr.",
  "Trump is the son of a wealthy real estate developer, has not always impressed old hands on Capitol Hill.",
  "“Trump is getting ready for his own no-deal, hard-out,” Mr.",
  "“I am surprised by it,” Mr. Light said. “Trump is someone who takes names. But contractors are compliant to a point. They have businesses they need to run. It is a sign of just how bad it is.”",
  "Trump is finding himself boxed in, in a familiar position when it comes to immigration issues.",
  "By insisting on a border wall, President Trump is emphasizing an issue that may be popular with his base but seems unlikely to attract new supporters.",
  "Trump is now crafting his own narrative of the confrontation that has come to consume his presidency.",
  "“Trump is killing us,” Mr. Kooiker said. “His bang for the buck is horrible.”",
  "Trump is a fan of tough-guy imagery, and he, or whoever makes his memes, probably just liked the idea of depicting himself as the patriarch of House Trump — First of His Name, Protector of the Realm — going medieval on national security.",
  "Trump is certain to prompt outrage from his critics and wild approval from his supporters, there is good reason to believe that it is unlikely to result in much immediate change.",
  "Trump is going through one in the midst of a protracted staff shake-up inside the West Wing and in his cabinet.",
  "Trump is making his claim based on  a study conducted by researchers  affiliated with Yale University and the Massachusetts Institute of Technology, which estimated the number at 22 million.",
  "Trump is scheduled to travel to southern Texas on Wednesday to dramatize his call for a wall.",
  "Trump is not forced to use his veto pen — would only change if Republican senators up for re-election begin to fear political costs of carrying the president’s water.",
  "“They know on some level that their defense of Trump is morally unsupportable, and so when they get a chance to speak out against Steve King, who doesn’t have any power over them and doesn’t pose a threat to them, a lot of them are falling over themselves to condemn him,” said Peter Wehner, who advised President George W. Bush on domestic policy. “But you can’t condemn Steve King and not condemn Donald Trump and pretend that you’re doing the right moral and ethical thing.”",
  "Trump is already trying to do the same to Ms.",
  "Trump is having adjusting to life in Washington under a divided government as it does about his treatment of women.",
  "Trump is trying to end.",
  "Still, Reid added: “Trump is an interesting person.",
  "“I disagree that Trump is a pessimist,” Reid said, as if to allow him that mantle would be paying him an undeserved compliment. “I think he’s a person who is oblivious to the real world.”",
  "Trump is taking the brunt of the blame for the impasse, showed little sign of capitulation.",
  "“Trump is a lying populist; Democrats need an optimistic realist,” said former Gov.",
  "“This anger about our divisions and where our country is going will be front and center — and the candidate who can speak to this division and be a direct contrast to Trump is going to do really well.”",
  "WASHINGTON — President Trump is cheerleading his way past the economic warning signs that have rattled financial markets and unnerved economists, insisting that the United States has an advantage in a crucial first round of trade negotiations beginning on Monday in Beijing.",
  "Trump is correct about China’s economy, which  by several measures  appears to be hobbled by American tariffs on $250 billion worth of Chinese imports.",
  "“I think President Trump is going to stand strong, and I’m going to stand strong with him.”",
  "WASHINGTON — A top American diplomat signaled on Thursday that the United States might no longer demand that North Korea turn over a complete inventory of its nuclear assets as a first step in the denuclearization process that President Trump is pursuing.",
  "Trump is not the first president to try to turn a hardened foe into a pen pal.",
  "“If he would go up there and balk the Democrats, like Schumer and Pelosi, and say, ‘Hey, I think Trump is right,’ and all that kind of stuff, I wouldn’t mind splitting my ticket,” said Ms.",
  "Trump is showing no signs of backing down, the pressure may be building on Republicans in Congress.",
  "Trump is threatening the country’s democratic institutions.",
  "“Donald Trump is going to be impeached whether it is by the ballot box or Congress,” said Representative Eric Swalwell, Democrat of California and a member of the Intelligence Committee. “It will just be a matter of which one comes first.”",
  "Trump is not on the same page as his national security team.",
  "(Mr. Trump is probably less popular in Utah than almost any largely Republican state.)",
  "Trump is planning a trip to the border in McAllen, Tex., on Thursday, while Democrats plan to bring up a succession of bills this week to reopen shuttered parts of the government, including the Internal Revenue Service, to allow tax refunds to be paid, and the Agriculture Department, to ensure that food assistance and farmer support payments can be made.",
  "Trump is not concerned that the company reduced its revenue forecast this week, sending stocks tumbling.",
  "Trump is now expected to attend the World Economic Forum this month in Davos, Switzerland, his administration has resisted Chinese efforts to schedule any formal trade negotiations then.",
  "Trump is now facing that critical choice — one the president has never talked about publicly — at a moment of considerable internal disarray, especially at the Pentagon.",
  "Trump is aware of that case.",
  "President Trump is expected to issue an executive order prohibiting American companies from incorporating equipment originating from China in critical telecommunications networks, extending current rules that apply only to government entities.",
  "Trump is poised to pass if the impasse continues.",
  "WASHINGTON — Vice President Mike Pence told American ambassadors on Wednesday that North Korea has failed to take any substantive steps to give up its nuclear weapons, even as President Trump is moving toward a second meeting with Kim Jong-un, the North Korean leader.",
  "DAVOS, Switzerland — A month before President Trump is scheduled to meet for a second time with Kim Jong-un of North Korea, Prime Minister Shinzo Abe of Japan appealed to Mr.",
  "Trump is pursuing an “opportunistic and transactional policy toward North Korea,” Mr.",
  "Trump is the first president or major presidential candidate in decades to refuse to release his returns.",
  "Trump is looking for more products to target.",
  "Trump is vulnerable in a primary.",
  "Trump is especially fixated on two well-known Democrats, speaking frequently about Joseph R.",
  "Trump is expected to  meet next month with Kim Jong-un , the North Korean leader, in a second round of direct negotiations aimed at ridding Pyongyang of its nuclear weapons.",
  "“I think what we’ve learned from President Trump is that people like authenticity.”",
  "Trump is  expected to meet with North Korea’s leader , Kim Jong-un, next month.",
  "Trump is aware that the brief one he delivered this month fared poorly in polls and in viewership ratings, making it less palatable to him.",
  "Trump is being pressured by the markets and the corporate sector to deliver a deal.",
  "That’s nearly double the $5.7 billion President Trump is seeking for a southern border wall — a project he still wants and is still threatening to shut down the government to get.",
  "Trump is simply giving back protections that he himself took away.",
  "Trump is agitated by the prospect of Mr.",
  "Trump is losing leverage in the Middle East by pulling out American troops.",
  "Trump is less of a cartoon figure than he is in most accounts contained in new books about the White House.",
  "Trump is increasingly eager to reach a deal that will help calm the markets, which he views as a political electrocardiogram of his presidency.",
  "“President Trump is holding the government hostage over his wall, using the well-being of millions of Americans as hostage in a futile attempt to get what he wants: a concrete border wall,” said Senator Chuck Schumer of New York, the Democratic leader.",
  "Now President Trump is running a much larger enterprise.",
  "Trump is using a rare currency — a prime-time address to the nation — to make the case for a border wall with Mexico, an issue that has forced a partial shutdown of the federal government.",
  "Trump is set to head to Texas’ border with Mexico on Thursday.",
  "Trump is seen inside the White House as having unique sway over her father, especially when it comes to personnel decisions.",
  "Trump is credited with envisioning, is to generate $1.6 billion in capital for female entrepreneurs in developing countries.",
  "Trump is not lost on him.",
  "Trump is holding federal workers “hostage” — a popular word in the responses — and causing them economic hardship.",
  "“Donald Trump is an irrepressibly press-savvy, communications-centric president,” Ms. Conway said. Of Mr. Shine, she added that he “has a gut for what sells and an eye for what compels.”",
  "Trump is contemplating.",
  "Trump is doing.",
  "Trump is then planning to tap, for example, says its authority may be used “in no case where the item for which funds are requested has been denied by the Congress” — raising the question of whether extra funding for border barriers counts as such a forbidden item.",
  "Trump is enlisting David Bernhardt, the acting secretary of the interior, whose department oversees the National Park Services.",
  "Trump is relying upon, and his administration argues that this means he is exercising authority that lawmakers wanted the presidency to be able to wield.",
  "Trump is also expected to make an appeal to his evangelical anti-abortion base by talking about the “fundamental importance and respect for human life,” the official said.",
  "“Together we can break decades of political stalemate,” Mr. Trump is expected to say, according to an excerpt from the speech shared by the official. “We can bridge old divisions, heal old wounds, build new coalitions, forge new solutions and unlock the extraordinary promise of America’s future. The decision is ours to make.”",
  "• President Trump is reportedly eager to meet with President Xi Jinping of China to discuss a trade deal.",
  "Trump is expected to announce his pick tomorrow.",
  "• Some trade hard-liners fear that President Trump is  being played  by China during current negotiations.",
  "Trump is preparing to hold a rally for supporters in El Paso.",
  "President Trump is expected to sign an executive order today meant to spur the development and regulation of artificial intelligence,  Cade Metz of the NYT writes .",
  "Trump is to introduce the “American A.I.",
  "Trump is trying to circumvent standard practices about former employees who use unclassified information in their books, and to seek retribution that would not otherwise be available to him through the federal government.",
  "Trump is expected to meet with Kim Jong-un, the young leader of North Korea.",
  "Trump is installing a loyalist and presidential campaign adviser to a prominent post with a five-year term.",
  "Trump is used to dealing with “S.N.L.” as a celebrity, someone who might be mocked but would be in on the joke.",
  "“Trump is an insult to my proud military family,” said Isabel Harris, 60, an immigrant from Mexico who held a sign honoring her son Martin Ferrufino, 32, a disabled veteran of the Iraq war.",
  "Trump is scheduled to begin speaking at a Make America Great Again rally at the El Paso County Coliseum at 7 p.m.",
  "WASHINGTON — President Trump is planning to introduce an initiative on Thursday that will seek to help bring economic security to 50 million women across the world by 2025, a program that his eldest daughter, Ivanka Trump, has hailed as a nonpartisan and “generous” approach to women’s empowerment.",
  "Trump is not expected to declare the state of emergency during Tuesday’s address.",
  "“The party of Trump is relying on lies and fear to try to strip women’s rights,” she said on Thursday. “New York will not be intimidated and we will continue to fight for women’s health and be a progressive beacon to the rest of the nation.”",
  "Trump is the first president or major party nominee to refuse to release his personal tax returns since doing so became the norm in the 1970s.",
  "So when people say, “Everybody who voted for Donald Trump is a racist,” I know that not to be true.",
  "We’re trying hard not to say that everyone who voted for Donald Trump is the same as Donald Trump.",
  "“In demonizing the free press as the enemy, simply for performing its role of asking difficult questions and bringing uncomfortable information to light, President Trump is retreating from a distinctly American principle,” Mr. Sulzberger said. “It’s a principle that previous occupants of the Oval Office fiercely defended regardless of their politics, party affiliation or complaints about how they were covered.”",
  "Trump is not the only one with political imperatives in the border security debate.",
  "Trump is said to be considering Herman Cain, the former pizza company executive and Republican presidential candidate, for a seat on the Federal Reserve Board.",
  "Trump is prepared to demand from Mr.",
  "Trump is expected to use his Hanoi summit meeting to push for a freeze on North Korea’s nuclear and missile programs, as well as a “road map” for ridding the country of all its nuclear and other weapons of mass destruction and their delivery systems, according to United States officials.",
  "Trump is  growing impatient  and wants to strike an agreement.",
  "Trump is the first American president willing to engage directly with any North Korean leader.",
  "Trump is led by President Moon Jae-in, who has repeatedly  vouched for  Mr.",
  "“Trump is certainly doing his negotiating team no favors by undercutting them in public,” said Eswar Prasad, a trade expert and the former head of the China division of the International Monetary Fund. The president’s actions, he said, “weakens rather than fortifies Lighthizer’s leverage.”",
  "Lighthizer “believes President Trump is the greatest trade president in our history and is honored to help him,” Mr.",
  "Trump is now firmly aligned with that view.",
  "WASHINGTON — Faced with limited options and a looming deadline to prevent another government shutdown, President Trump is moving toward accepting a border security deal that would fall well short of his once firm demand for $5.7 billion in funds for a wall along the southwestern border.",
  "Trump is not the cause, said Norbert Röttgen, the chairman of the German Parliament’s foreign relations committee, but a symptom of the tectonic shifts in geopolitics that have led to the return of great power rivalry and centrifugal forces away from multilateralism.",
  "“People said, ‘Trump is crazy,’” he said at one point, discussing his outreach to Mr. Kim. “And you know what it ended up being? A very good relationship.”",
  "“Fortunately, Donald Trump is not the last word,” said Mr. Newsom, a Democrat. “The courts will be the last word.”",
  "WASHINGTON — President Trump is expected to announce in his State of the Union speech a national commitment to end transmission of the virus that causes  AIDS , with a goal of stopping its spread in this country by 2030.",
  "Trump is also expected to highlight his efforts to bring down prescription drug prices and to combat the opioid epidemic.",
  "WASHINGTON — After two months spent scorching the earth in Washington and complaining about being cooped up in the White House, President Trump is planning to return this weekend to the one place where he knows he will receive a hero’s welcome for his troubles: Mar-a-Lago, his gilded club by the sea in Palm Beach.",
  "Trump is expected to do many of the things he always does when he is at Mar-a-Lago: dining at the owner’s table on the patio; spending the afternoon at Trump International Golf Club, about a 15-minute motorcade drive away; and never venturing anywhere in Palm Beach outside his own two properties.",
  "Trump is in town, one said — but many will brave the roads for the chance to participate in a presidential selfie or a similar show of support.",
  "Trump is repeating his widely  debunked  claim made in his State of the Union address that El Paso transformed from “one of the most dangerous cities” into one of the safest cities in the United States after the construction of barriers at the border.",
  "Trump is expected to  make immigration a cornerstone  of his State of the Union speech, which is scheduled for Tuesday.",
  "WASHINGTON — President Trump is preparing to establish a panel to examine whether climate change affects national security, despite existing reports from his own government showing that global warming is a growing threat.",
  "Trump is wielding extraordinary power to get his way.",
  "Trump is willing to risk the blowback, even from members of his party, and a possible court defeat, if it means he can tell his core supporters that he did all he could to build the wall.",
  "Trump is an entertainer and an agitator, which Graham says he can relate to, in a way.",
  "“Two years ago we made Obama, but this Trump is our best creation to date,” said one of the sons, Mohammad Zaerin, 27.",
  "Trump is a target, and the president could not recall when Mr.",
  "Trump is illegally profiting from the presidency.",
  "Trump is under pressure to use the Hanoi meeting to work out concrete plans for carrying out the June agreement.",
  "Trump is the only president in the history of Gallup polling to have never drawn the support of a majority of the public at any point in his first two years in office.",
  "Trump is confusing an existing program for veterans’ health care with recently enacted overhauls.",
  "Trump is right that the majority of heroin comes in through southern border, but contrary to his assertions, most of it comes through ports of entry,  according to the Drug Enforcement Administration.",
  "“Politicians don’t operate the way he does,” Mr. Fleischer said. “Frankly, it’s put him at risk and put the Republican Party at risk, but it also allows him to take on China and do something of tremendous consequences that no politician would ever do. If Trump is successful, this will be a better country and a better world for it.”",
  "Trump is long, but the number of times he has followed through is exceedingly short.",
  "WASHINGTON — President Trump is scheduled to undergo the second physical of his presidency on Friday, an annual checkup for a commander in chief who has maintained that he is the picture of stamina.",
  "Trump is then to convene a full cabinet meeting on Tuesday, officials said.",
  "Trump is set to hold a rally in El Paso on Monday night, using the border city as evidence for his exaggerated claim that a wall would reduce crime.",
  "Trump is planning to tap different pots of money in sequence, and only the fourth and last pot involves the emergency-powers statute.",
  "Trump is seeking for his border wall.",
  "“It was a very tough dialogue at the beginning,” Mr. Trump recalled on Friday. “Fire and fury. Total annihilation. My button is bigger than yours and my button works. Remember that? You don’t remember that. And people said, ‘Trump is crazy.’",
  "Pompeo’s Trump is the Trump of the National Security Strategy, a wise and clearheaded executive who knows what he wants and has respect for the collaborative nature of statecraft.",
  "Pompeo’s Trump is someone who is willing to shame rogue nations with “moral clarity,” just as Ronald Reagan declared his allegiance to the long-suffering people of the Soviet Union by calling out its leadership as “an evil empire.” Trump’s instructions percolate down through his cabinet in the form of something called “commander’s intent,” a military concept used to help units interpret their missions.",
  "“Reagan was pegged for being stupid, but he had an idea of what America should be,” he said. “Trump is like that. He has a vision for what he wants.”",
  "Trump is not required to release any of his medical findings.",
  "Trump is hoping for  concrete and verifiable progress  toward denuclearizing North Korea.",
  "“Trump is not the United States,” Bae Myung-bok, a senior columnist for the daily JoongAng Ilbo,  wrote last month , urging South Korea not to give in to Washington’s demands.",
  "Trump is alleged to have had an affair.",
  "Trump is fond of referring to journalists as “the enemy of people.” In recent months, the White House has sharply reduced the number of press briefings it gives and has cracked down on reporters who call out questions during the president’s public appearances.",
  "President Trump is in “very good health,” according to Dr.",
  "“Trump is hitting it right on the nose,” he said. “New York has become another super liberal state like California, and we have a governor who is so vain that it’s all about him, and the way people view him nationally, because he has his heart set on being drafted to be president of the United States. He has little regard for the problems of upstate New York.”",
  "Trump is scheduled to travel to Vietnam next week for a summit with Kim Jong-un, the leader of North Korea.",
  "Trump is scheduled to speak before about 6,000 people at the El Paso County Coliseum, Mr.",
  "Trump is  supposedly considering a 60-day extension  to the looming March 2 deadline for a deal.",
  "Cohen  plans to tell Congress on Wednesday that President Trump is a “con man” and a “cheat” who knew a longtime adviser was communicating with WikiLeaks — and who implicitly instructed  Mr.",
  "“Mr. Trump is an enigma,” Mr. Cohen will say. “He is complicated, as am I. He has both good and bad, as do we all. But the bad far outweighs the good, and since taking office, he has become the worst version of himself.”",
  "“Mueller is now slightly more distrusted than trusted, and Trump is a little ahead of the game,” Mr.",
  "Trump is correct that there were 23 murders in El Paso last year, compared with more than  1,200 murders  in Ciudad Juárez, Mexico.",
  "Trump is right that previous presidents have issued  58 national emergency declarations  since 1978,  30 of which are still in effect .",
  "“Fortunately Donald Trump is not the last word,” he said. “The courts will be the last word.”",
  "Trump is practically inevitable as the inquiries proceed.",
  "Trump is thinking about the 2020 race.",
  "Trump is expected to announce a plan to stop transmission of H.I.V.",
  "Trump is not expected to veer from his demands for billions of dollars in funding for border security, including some kind of barrier.",
  "Trump is also likely to say that the new trade agreements with Canada and Mexico, combined with his aggressive use of tariffs against China, have made the trade environment far more favorable to the United States.",
  "Trump is not the kind of bigot that Ms.",
  "“This is Alabama, and although not overly common, it is also not rare for citizens to give politicians their Bibles to sign,” said Angi Stalnaker, a Republican political consultant in the state. “To read into this any sort of ‘We believe Trump is God’ or anything like that would be unfair. It’s just something that on occasion happens in the South.”",
  "Trump is the fourth consecutive president, at least, to visit Alabama to survey tornado damage.",
  "“Trump is a whimpering coward. He was afraid to go to Vietnam 47 years ago and is afraid to face the legal consequences of his actions today.”",
  "Trump is trying to secure with an emergency declaration that would circumvent Congress.",
  "Trump is playing host to Mr.",
  "Trump is free to brag about 3.1 percent G.D.P.",
  "Trump is wrong that his predecessor did not turn over any documents at all.",
  "Trump is hoping to avoid a repeat of last year’s budget deal, in which he was forced to agree to major domestic spending increases to secure his military boost.",
  "Trump is scaling back military operations in Afghanistan and Syria.",
  "Trump is seeking would enable him to complete the project, with a total of 700 miles of barriers, most of it new, though with some sections refurbished.",
  "For starters, Trump is almost impervious to it.",
  "Trump is in office.",
  "“Without a well-conceived diplomatic strategy, Trump is simply undermining our national security by making clear that the United States is not a trusted foreign policy partner.”",
  "Trump is another matter.",
  "The North Korean photographers like to be elevated because President Trump is taller than Kim Jong-un — so most of the U.S.",
  "Obama was the most photogenic president I’ve covered, and Trump is the most iconic.",
  "Trump is still really, really popular among Republicans.",
  "Trump is subverting the Constitution, which grants Congress clear control over federal spending.",
  "Trump is hoping to divert $3.6 billion from military construction projects to his cherished wall at the southwestern border, effectively subverting lawmakers and the budget they set.",
  "Trump is taking funds that were carefully doled out after months of negotiation in the bill that he signed last month to fund the government through Sept.",
  "Trump is expected to sign a document formalizing the United States’ recognition of Israel’s sovereignty in the Golan Heights — a strategically important plateau that Israel captured from Syria in the Arab-Israeli War of 1967 but which under international law is considered occupied territory.",
  "Trump is not fond of her, White House officials said, and he had no problem making her appear to be the bad actor in relation to the Special Olympics.",
  "Trump is admired more than in almost any other country.",
  "Trump is neither.",
  "Trump is the  warrior-king Jehu, who took control of the nation and cast idols out of the capital.",
  "“Trump is offering us a window for revival, a window to return to God,” Mr. Cahn said. “What happened in the election was not about Trump but about something much higher, the purposes of God.”",
  "The man accused of mailing pipe bombs to critics of President Trump is expected to plead guilty next week in federal court in Manhattan, the court’s docket shows.",
  "“Trump is always better when he has somebody to pick on,” said Wes Gullett, a Republican strategist based in Arizona, adding wryly, “If Democrats were smart, they would move their convention back until about Oct. 15.”",
  "Trump is doing so by choice, though with his relentless use of social media and extraordinary accessibility to the media, he is hardly a cloistered figure.",
  "Trump is asking for more personnel at Customs and Border Protection and Immigration and Customs Enforcement and for a policy change meant to end so-called sanctuary cities, which do not hand over undocumented immigrants to federal officials when they are arrested in local crimes.",
  "Trump is innocent of many accusations and has broad powers in his office to run the government as he chooses.",
  "Trump is Mr.",
  "Trump is saying publicly is not true, there is no apparent legal duty for the Justice Department to correct the president.",
  "Trump is on that list.",
  "Trump is a devoted viewer who responds in real-time to “ Fox & Friends ,” counts a former Fox News co-president as his deputy chief of staff, dines at the White House with Fox News stars like Sean Hannity and Jesse Watters, consults with Fox News commentators on policy decisions and sees his talking points beamed back at him every weeknight during the Fox News prime-time block.",
  "Trump is seeking to punish those countries for what he says is a failure to stop migrant caravans from making their way north.",
  "Trump is making no attempt to appeal to such voters.",
  "“I think if it’s going to happen, now is the time and Trump is the candidate to be running against.”",
  "Trump is violating the clauses in the Constitution that restrict federal officials from accepting government-bestowed financial gains or “emoluments,” other than their salaries.",
  "Trump is profiting from foreign- and state-government guests who patronize the Trump International Hotel, he has allowed it to proceed to the evidence-gathering stage over vigorous objections by the Justice Department.",
  "Trump is cleared of that offense, and he has  Mr.",
  "Trump is of paramount importance to the Judiciary Committee, which twice in the past half-century has included obstruction in articles of impeachment against a president.",
  "“Donald Trump is in the conference room,” she whispered.",
  "Trump is focused on vengeance after the end of the investigation led by the special counsel, Robert S.",
  "Trump is willing to give them.",
  "“Fair is fair,” he said. “Barr says Mueller says there was no collusion between Trump and Russia, so we have to cross collusion off the list of reasons Trump is unfit to be president.”",
  "returned to the subject of the Mueller report in  another sketch  later in the evening, this time from the perspective of the Russian president Vladimir Putin (Beck Bennett) as he sheepishly acknowledges to his underlings at the Kremlin that Trump is not one of his agents.",
  "“Trump is a branding guy,” said David B. Srere, co-chief executive and chief strategy officer at Siegel+Gale, a brand consultancy. “He knows his audience and understands how to tell a clear, simple story.  Climate advocates  and the scientific community need to get better at understanding their audience and figure out how to tell a simple, repeatable story of their own.”",
  "President Trump is expected to detail several proposals to combat fraud in the program in his 2020 budget, to be issued on Monday.",
  "Trump is correct and growth surges again, he will enter 2020 with arguably the strongest economic record of any incumbent president facing re-election since Bill Clinton in 1996.",
  "“Instead of doing anything to address the issues that matter most to the people of Calexico, Trump is actually making things worse,” the committee said.",
  "Trump is the first president in four decades to not publicly release his tax returns.",
  "“The advantage of first term incumbency and the relatively strong economic performance ahead of the presidential election suggest that President Trump is more likely to win a second term than the eventual Democratic candidate is to defeat him.”",
  "• How President Trump is undercutting his own trade deals.",
  "Trump is often at odds with reality.",
  "Trump is having an impact.",
  "“Whichever Democrat wins the nomination will have to own their party’s socialist agenda,” she added. “That’s a debate that President Trump is eager to have and knows he can win.”",
  "Trump is the only president in the history of Gallup polling never to earn the support of a majority of Americans even for a single day of his term.",
  "Trump is building a campaign that is far more extensive than the ad hoc organization he had last time.",
  "“These are new voters,” he said. “You might call them low-propensity voters; they don’t vote year in and year out. President Trump is not a typical politician by any means so a lot of these states that we talk about, they are not necessarily Republican states, they are Trump states.”",
  "Trump is once again mixing projects to replace existing barriers with construction of entirely new sectors of a wall along the southwestern border  — and inflating the mileage.",
  "Trump is relinquishing, Mr.",
  "Trump is referring to the Pentagon’s so-called 1033 program, which has been sending excess military equipment to the police since the 1990s.",
  "Trump is usurping the role of a coequal branch of government.",
  "Trump is betting that portraying the crisis that he says now exists on the Mexican border will be just as effective in his re-election campaign as the issue was in 2016.",
  "Trump is certain to face several challengers among the Democrats who are determined to make the president’s immigration agenda a key part of their reason for running.",
  "“Donald Trump is all things to all people,” he told me in his Greenwich Village apartment recently, under the gaze of his ample collection of European church statues from the medieval to the Baroque periods.",
  "Trump is in the Oval Office and Mr.",
  "“If you go with Trump, it solves the short-term temper tantrum and the threat of trade wars on the horizon,” she said. “But that is also taking a big legal risk. Because in the long term, California could win the legal fight to keep its state standards. Trump is right now, but California is forever.”",
  "Trump is seeking to rally his base by sounding that theme again.",
  "“What motivates Trump is still a mystery,” Mr. Weiss said. “Every time he talks about this is so out of sync with the way Republicans, or Democrats, talk.”",
  "Trump is popular, like West Virginia and Ohio.",
  "Trump is operating under mounting pressure from unauthorized border crossings that are steadily increasing.",
  "Trump is pushing to restart the practice of family separation.",
  "A lot of Republicans will say privately that they believe Trump is weak because the economic policies he has pursued have not helped the working class in the ways he promised during his campaign.",
  "Trump is prepared to return to a go-to move from his years as a real estate mogul.",
  "Trump is trying to force Havana to back off its support for Venezuela’s leader, Nicolás Maduro, whom administration officials said Cuba had propped up with more than 20,000 troops.",
  "“We are in the battle for the soul of this nation,” Mr. Biden said, warning that if Mr. Trump is re-elected, “He will forever and fundamentally alter the character of this nation, who we are, and I cannot stand by and watch that happen.”",
  "Trump is still backing him, as he has other men under fire for their own alleged conduct.",
  "Trump is often drawn instinctively to men who share his indiscretions — and to men he sees as having made a comeback after scandals that could have destroyed them, the way he thinks that he did.",
  "“Donald Trump is partly right — scoundrel that he is — because in Puerto Rico we live off the government,” said Ms.",
  "Because its language about not exonerating Trump is written in the negative, the most important sections are hard to quote.",
  "Through the entirety of the report, Trump is observed to lie, at almost every moment, like Falstaff telling Hal how many thieves he fended off.",
  "Plans for a comprehensive aid package for Venezuela come as President Trump is cutting aid to other countries, including Guatemala, Honduras and El Salvador, out of frustration over the way those nations have handled their migration policies.",
  "Trump is one-on-one, preferably with no one else in the room, since leaks appear inevitable when Mr.",
  "With 2020 elections looming, President Trump is keen to  tamp down gasoline prices , especially as summer approaches, when energy use surges and Americans take to the road.",
  "Trump is more attuned to the political opportunities the law offers him, rather than with ensuring it is enacted effectively.",
  "“Back home, what we have right now is an unmitigated disaster,” said Senator David Perdue, Republican of Georgia. “As an elected official, it’s our responsibility to bring solutions. And what President Trump is saying is that if Congress is gridlocked right now, which it is on this topic, then he wants to start a dialogue about what it is he stands for. And I applaud that.”",
  "Trump is raising money for the R.N.C., which brought in another $45.8 million in the first quarter.",
  "WASHINGTON — President Trump is embracing a new tactic as he tries to rewrite the rules of global trade: Don’t believe a final deal is truly final.",
  "Trump is to draw out negotiations for as long as possible, potentially waiting out Mr.",
  "Trump is also going to great lengths to stonewall expanding investigations by House Democrats, resisting efforts to obtain his tax returns, preventing former aides from testifying and  even pursuing legal action against Deutsche Bank , a longtime lender to the Trump Organization, and another bank to stop them from responding to congressional subpoenas.",
  "“It’s a different year, and Donald Trump is a different guy,” Mr.",
  "Trump is going nowhere, he may play on Mr.",
  "“We hear the word ‘exhaustion’ a lot,” Longwell explained when I met her in March in the lobby bar of the Madison Hotel, a few blocks from the White House. “That’s where Trump is vulnerable.”",
  "“The retrospective judgment is not the same as the prospective judgment,” he told me. There is a tendency among voters to hold on to what initially made them pull the lever for Trump. “He’s better than Hillary” remains a powerful argument to them nearly two and a half years after the last race ended. “There’s a reason Trump likes to keep relitigating 2016,” Kristol told me. “The prospective case for Trump is harder to make.”",
  "“Donald Trump is the only president who has decided not to represent the whole country,” accusing him of only caring about “his base.”",
  "Trump is banking on a much faster pace of growth than the Fed and most outside economists say is likely.",
  "“There’s no question that President Trump is seeking to undermine the long-term stability of the economy and independence of the Federal Reserve to boost his own re-election prospects,” said Senator Ron Wyden of Oregon, the top Democrat on the Finance Committee.",
  "“President Trump is the first president in nearly a half century to break precedent and refuse to voluntarily release his tax returns,” said Representative Dan Kildee, Democrat of Michigan and a member of the Ways and Means Committee. “The president is the only person who can sign bills into law, and the public deserves to know whether the president’s personal financial interests affect his public decision making.”",
  "Trump is not interested in being managed by aides who think they know better, and so he has tried to build a process that he thinks better serves the president.",
  "Trump is in office and busy running the country because it would be unfair to accuse him of an offense without giving him an opportunity to clear his name in court.",
  "Trump is spreading from the left wing of the House to Ms.",
  "Trump is faulting them when he could have asserted privilege over his conversations with aides and tried to prevent investigators from learning about those interactions.",
  "Trump is purposefully escalating his language, people who know him said, expressly to enliven his base of supporters and to enrage his political rivals and the news media.",
  "[President Trump is definitely building a wall — but it is  between the White House and the House of Representatives .]",
  "But the hearing comes as President Trump is stiffening his resolve to  fight Democrats at every turn  — a battle that could lead to constitutional clashes in the courts.",
  "Trump is getting rid of voices who sometimes cautioned him against taking actions they believed to be illegal or unwise.",
  "Trump is most popular among adults over the age of 55 and least popular with adults between the ages of 18 and 24.",
  "If President Trump is able to nominate additional justices who are confirmed, his successor’s influence on the death penalty would be limited to enacting a federal moratorium, nominating district court and appeals court judges and using the bully pulpit to make a case against capital punishment.",
  "Trump is changing the Fed’s course, the central bank has largely moved in the direction that the president wants.",
  "Trump is demanding it, but because he believes economic data have given the Fed no other choice.",
  "Trump is installing another veteran of previous administrations, not a loyal foot soldier of Mr.",
  "WASHINGTON — As he awaits  the Thursday release  of the redacted special counsel report on his 2016 campaign’s ties to Russia, President Trump is filling his idle moments — and blowing off any anticipatory steam — by turning to a familiar pastime: television.",
  "Trump is faulting them when he could have asserted privilege over his conversations with aides and tried to prevent investigators from learning about them.",
  "WASHINGTON — President Trump is definitely building a wall — but it is between the White House and the House of Representatives.",
  "Trump is hardly the first president to come under siege from a congressional chamber controlled by the other party.",
  "Now, in Venezuela, President Trump is facing his own red-line moment — again, with Vladimir V.",
  "Trump is not the only one looking for a rate cut.",
  "“This veto by President Trump is morally wrong and strategically wrongheaded,” said David Miliband, the president of the International Rescue Committee. “It sets back the hopes for respite for the Yemeni people, and leaves the U.S. upholding a failed strategy.”",
  "“Trump’s plan to release migrants into ‘enemy’ cities as if they are some kind of contagion is reprehensible,” Mr. Markey  tweeted . “Trump is obsessed with the border and sanctuary cities because he only wins by dividing people.”",
  "“Trump is on our side,” said Vladimir V.",
  "“President Trump is curtailing the public’s voice in an attempt to force dirty energy projects on communities across America,” said Joshua Axelrod, a lawyer for the Natural Resources Defense Council. “Pipelines like Keystone XL pose dangers to our water, our farms and our climate.”",
  "Yet President Trump is omitting that farm income reached $75.2 billion in 2017, before falling to $63.1 billion in 2018.",
  "Trump is now moving ahead with plans to impose 25 percent tariffs on all remaining Chinese imports.",
  "“While others have acknowledged China’s trade cheating for years and done nothing, President Trump is determined to not let China off the hook until it ends its destabilizing practices,” the committee said in a statement.",
  "“So Donald Trump is elected in the last two years — and I will confess, even he couldn’t screw up the momentum,” said Michael Bennet on “Meet the Press,” before mentioning housing, health care and higher education costs.",
  "Trump is growing more comfortable with crudeness.",
  "Trump is not atypical in his desire to get outdoors.",
  "Trump is running on the strongest economy of any president seeking re-election since Bill Clinton in 1996, and arguably since Richard M.",
  "Trump is confident the economy can withstand retaliatory action from China, but farmers and manufacturers in this region are among those most likely to be hurt by increased tariffs on American goods.",
  "Trump is something he considers very real.",
  "Trump is disciplined enough to stay on message about the economy is another question.",
  "President Trump is more confident in taking an aggressive negotiating stand because the stock market is up a lot this year and the American economy is looking solid.",
  "It wouldn’t be quite right or even possible to suggest that Donald Trump is “taking over” TikTok, or that there’s even an unusual amount of pro-Trump content on the app.",
  "“The relationship that evangelicals have with President Trump is a very transactional one,” said Mr. Land, who serves on a spiritual advisory board to the president. “They feel like their voices are heard and he is keeping their promises to them.”",
  "Trump is putting himself squarely on one side of perhaps the nation’s most divisive social issue.",
  "Trump is scheduled to fly into Shannon Airport, in western Ireland, after his three-day state visit to Britain, the administration said on Tuesday.",
  "“Trump is taking a seat for Abe’s promotion,” said Shizuka Wada, the author of “A View of a Female Sumo Fan.”",
  "Now President Trump is sealing up that wall from the other side.",
  "Trump is determined to present himself as tougher on the Chinese than any of his potential challengers in 2020.",
  "Trump is fond of using “tariff” as a verb and waving off concerns that they raise consumer prices and depress economic activity.",
  "Trump is using tariffs to pressure other countries to open their markets more freely.",
  "“She’s a mess. She’s lost it,” the president said during an event to  announce $16 billion in aid  to farmers, in part to compensate for his tariffs policy on China. That event transformed into a monologue and a question-and-answer session with reporters, which included a reprisal of an  old self-assessment  that Mr. Trump is an “extremely stable genius.”",
  "Trump is headed to Japan on Friday and Congress goes on a weeklong Memorial Day recess, ensuring that little will be resolved any time soon.",
  "Trump is not the first president to politicize the military: George W.",
  "Trump is generally popular in the rural Midwest.",
  "Trump is willing to take his battle and what it produces in the end.",
  "“Trump is dragging a dangerous misconception into a critical moment in his standoff with the Chinese,” Chad Bown, an expert on trade at the Peterson Institute for International Economics, said last week. “And American businesses and consumers stand to pay the price.”",
  "Trump is confident in his approach, his decision to add new trade barriers with China — in the form of higher tariffs — has confounded analysts and some business groups that have otherwise praised his handling of the economy.",
  "On Monday, President Trump is to bestow on Tiger Woods the Presidential Medal of Freedom.",
  "Trump is expected to address the importance of deterring aggression when he visits American troops stationed at the Yokosuka naval base on Tuesday.",
  "Trump is expected to return to Japan next month for the Group of 20 meeting in Osaka and Mr.",
  "Trump is trying to block him from doing so); and whether the special counsel, Robert S.",
  "Trump is determined to flout historical convention and cannot be shamed into compliance.",
  "Trump is juggling multiple trade conflicts today, with allies and rivals alike.",
  "Trump is in office.",
  "Trump is hardly new.",
  "Trump is set to once again seize Mr.",
  "Trump is battling efforts to get further information about his personal finances, including demands by House Democrats for his tax returns, while the Trump Organization has gone to court to halt requests from Democrats for other financial records.",
  "Trump is determined to put up a fight over such issues for every subpoena, appealing any losses all the way to the Supreme Court.",
  "Trump is using the issue to rouse his base, including the crucial voting bloc of Christian conservatives for whom abortion is an overarching issue.",
  "President Trump is a regular subject of the artist  Jon McNaughton , who has been painting for about four decades but whose work turned to politics in 2008, when he painted John McCain.",
  "“It sounds like he’s asking us to impeach him,” Mr. Cummings, the chairman of the House Committee on Oversight and Reform and a top lieutenant to Speaker Nancy Pelosi, said in an interview last week. Ticking off all the ways Mr. Trump is stonewalling Congress, he added, “He puts us in a position where we at least have to look at it.”",
  "Trump is accepting financial benefits from foreign governments in violation of the constitutional restrictions laid out in the so-called emoluments clauses.",
  "Trump is still in office.",
  "Trump is not fond of Mr.",
  "WASHINGTON — President Trump is upending the United States economy, and perhaps jeopardizing his re-election prospects, with an abrupt escalation of protectionist trade policies.",
  "“We don’t know what straw will break the camel’s back here, but Trump is looking like he wants to try to find out,” Tim Duy, an economist at the University of Oregon,  wrote in a blog post  on Friday.",
  "Trump is banking on a strong economy to help his re-election prospects next year.",
  "Trump is neither as savvy a negotiator nor as ready to use military force as he claims.",
  "Trump is irate that the strategies devised by his national security adviser, John R.",
  "“Trump is dragging a dangerous misconception into a critical moment in his standoff with the Chinese,” Chad Bown, an expert on trade at the Peterson Institute for International Economics, said last week. “And American businesses and consumers stand to pay the price.”",
  "Trump is less an ideologue than an armchair naysayer about climate change, according to people who know him.",
  "Trump is in the midst of a  high-stakes showdown  with Mr.",
  "Trump is at the center of nearly every current event.",
  "Trump is confronted with the consequences of his decision.",
  "Trump is just staging a confrontation to force Iran to negotiate a new deal.",
  "Trump is successful in isolating Huawei, billions of bits of data will flow through undersea fiber-optic lines — many of which its subsidiary Huawei Marine is laying — and through satellites connecting the two competing internet environments.",
  "Trump is the first of President Trump’s children to be subpoenaed in the continuing congressional investigations into Russia’s 2016 election interference, and the move by the Republican-led committee is a sign that some members of the president’s party are not aligned with his desire for a swift end to all of the Russia inquiries.",
  "Trump is a scion of President Trump’s global business empire and was one of his father’s close advisers during the election.",
  "“She’s a mess. She’s lost it,” the president said during an event to  announce $16 billion in aid  to farmers, in part to compensate for his tariffs policy on China. That event transformed into a monologue and a question-and-answer session with reporters, which included a revival of an  old self-assessment  that Mr. Trump is an “extremely stable genius.”",
  "Trump is primed to try to exploit any such effort politically.",
  "Trump is an unpopular idea, in a difficult spot heading into the 2020 election.",
  "Trump is not expected to attend the Bahrain conference since he will be heading that week to Japan for a meeting of the Group of 20 economic powers.",
  "TOKYO — As the leader of the free world, and a man never shy around the spotlight, President Trump is rarely a spectator to the events surrounding him.",
  "“No matter what he may think, Donald Trump is not a King,” Ms. Warren added. “No President is. And our democracy only works if everyone can be held accountable.”",
  "Trump is keenly aware that he won in 2016 with support from union voters who did not follow their leaders in backing Hillary Clinton.",
  "“It just shows everybody that the vice president is the candidate Trump is most concerned about,” said Representative Cedric Richmond of Louisiana, a Biden supporter, adding with evident relish: “He just can’t help himself during executive time.”",
  "Trump is in favor of legal immigration.",
  "Trump is stonewalling.",
  "“I can’t control the timing of when Trump is going to tweet something,” said Mr. Hughes, the chief executive. “It makes it look like something weird was going on, but it was nothing nefarious.”",
  "Trump is publicly making the case that  Roy Moore , the controversial former  Alabama  judge, could cost Republicans a Senate seat in an overwhelmingly conservative state if he chooses to run again.",
  "“And so I think what President Trump is reflecting is actually the will of the people of Alabama,” Mr.",
  "President Trump is expected to name Kenneth T.",
  "Trump is determined to get down into the mud himself and wrestle with his enemies at every turn.",
  "Trump is actually trying to goad them into impeaching him on the theory that it would help him politically.",
  "“President Trump is quite willing to sacrifice his agenda to defend himself,” said former Senator Tom Daschle of South Dakota, who was the Democratic leader during Mr. Clinton’s impeachment trial in 1999. “He believes that no one can do that as effectively as he can, and, for him, that takes priority over any legislative issue.”",
  "“Ensuring President Trump is re-elected is the most critical task at hand, and I'm honored to take on the important role of helping deliver the resources he needs for a huge victory next year,” Mr.",
  "Trump is subjective, but Mr.",
  "Trump is paramount — and that that goal is somehow at odds with embracing disruptive ideas or structural policy change.",
  "“This problem with Iran goes back decades,” he said. “Now, it’s about money: Trump is close to the Gulf countries because he wants to make money from them.”",
  "Yang  filed a lawsuit  against The Miami Herald, accusing the newspaper of defamation for “painting a picture that President Trump is corrupt, and that Yang is one of his cronies” in an article that explored her access to the president and her past ownership of the spa.",
  "Trump is less frustrated with Mr.",
  "Trump is also impatient with another of Mr.",
  "Trump is not the first president to accuse congressional investigators of partisanship.",
  "Trump is back in a comfort zone of viewing diplomacy through a lens of economics and business deals, and the action reinforces White House support for the Saudis despite congressional pressure to punish Crown Prince Mohammed bin Salman after the  killing last October of the journalist Jamal Khashoggi  in the Saudi Consulate in Istanbul.",
  "Trump is scheduled to host a rally on Wednesday in Panama City Beach, Fla., an area devastated last year by Hurricane Michael.",
  "“We don’t know what straw will break the camel’s back here, but Trump is looking like he wants to try to find out,” Timothy Duy, an economist at the University of Oregon,  wrote in a blog post  on Friday.",
  "Trump is enthusiastically calling for the toppling of one regime, in Venezuela, and energetically undermining another, in Iran.",
  "President Trump is trying to change the requirements for migrants entering the United States, making immigration more difficult for those trying to unite with their families — and putting more emphasis on a migrant’s skills and cultural values.",
  "Trump is succeeding not only in evading accountability himself but also in permanently rewriting the rules of engagement between the legislative and executive branches.",
  "Trump is being prodded to take an aggressive position on Venezuela by Senator Marco Rubio, Republican of Florida.",
  "Donald Trump is a New York guy.",
  "“Trump is goading us to impeach him,” she said at a Cornell University event in Manhattan. “That’s what he is doing; every single day he is just, like, taunting, taunting, taunting. Because he knows that it would be very divisive in the country. But he doesn’t really care; he just wants to solidify his base.”",
  "Trump is “not the billionaire he said he was, just another scumbag,” he also thought constantly about going back to him.",
  "Trump is endorsing an effort to push a foreign government to proceed with a case that could hurt a political opponent at home.",
  "Trump is scheduled to visit Japan next week, and his hosts are planning a full slate of high-level hospitality.",
  "“Trump is goading us to impeach him,” Speaker Nancy Pelosi said at a Cornell University event in Manhattan this week.",
  "Trump is pushing Democrats on impeachment, Mr.",
  "Trump is not the only commander-in-chief enamored with his famous plane,  which is equipped  with a medical suite, sleeping quarters and a kitchen that can serve 100 meals at once.",
  "Trump is caught between an audience that — in Florida, by the roaring thousands — rewards him passionately for playing the hits, and another that is voting (at least with its remotes) as if it’s seen this story before.",
  "“Trump is president because ‘the deplorables’ rejected the decline of America sanctioned by the elites,” said Stephen K. Bannon, the president’s former chief strategist. “The established order from Day 1 has fought a rear-guard action to nullify his election. This campaign is a continuation of the first — in all its vitriol and promise.”",
  "Trump is concerned by such results, he isn’t showing it.",
  "Trump is now taking advantage of.",
  "“The best thing about Trump is his America First policy,” he said.",
  "Trump is determined to avoid a fight, and that the downing of the drone has strengthened their hand in any future negotiations.",
  "Trump is betting that the 2020 campaign will be a “Back to the Future” replay of the 2016 one, when a reality TV star and New York real estate mogul campaigned as a disrupter with nothing to lose and shook the political establishment to its core.",
  "Trump is backed by an operation that is sleeker and more sophisticated than the ragtag team he ran out of the 26th floor of Trump Tower.",
  "Trump is using to punish China, Mexico, Europe and other governments would more than wipe out any gains from his $1.5 trillion tax cut for low- and middle-income earners, leaving them with less money to spend into a consumer-driven economy.",
  "“In some ways, President Trump is on a collision course with himself,” said Robert Malley, the president of the International Crisis Group and a former Iran adviser to Mr. Obama. “He says he’s in favor of maximum pressure and he’s against military confrontation when it comes to Iran but both of those things can’t be true because one of those things can lead to the other.”",
  "Trump is surrounded within his own team by  hawks like Secretary of State Mike Pompeo and John R.",
  "It’s not just a case of “if Trump is for it, we’re against it” contrarianism for Democrats: Republicans’ approval of trade agreements rose over that same period, to 40 percent from 23 percent.",
  "“I think Trump is hugely vulnerable on trade, but Democrats haven’t quite figured out how to attack that vulnerability yet,” said Jared Bernstein, a senior fellow at the Center on Budget and Policy Priorities. “Trump’s approach has made things worse for both key Democratic and Republican constituents.”",
  "WASHINGTON — President Trump is increasingly blurring the line between America’s national and economic security, enabling him to harness powerful tools meant to punish the world’s worst global actors and redirect them at nearly every trading partner, including Mexico, Japan, China and Europe.",
  "Trump is scheduled to return from his European trip on Friday.",
  "Trump is in office.",
  "“I think Trump is looking for a win to strengthen his chances in the election, but the trade war is also being understood by more sectors of the United States public,” Mr.",
  "“This is a major win for Xi Jinping — it seems like President Trump is willing to make concessions on almost all fronts,” said Bo Zhiyue, the deputy dean of the New Era Development Research Institute at Xi’an Jiaotong-Liverpool University in Suzhou, China.",
  "Trump is wise to remain patient.",
  "President Trump is expected to meet with China’s top leader, Xi Jinping, at a Group of 20 meeting in Japan   this month , and clemency for Huawei could be part of a broader compromise on tariffs.",
  "Trump is viewing international economic policies through an increasingly narrow lens, observing only how decisions will affect the United States and seeing other countries’ attempts to help their economies as working against America’s interests.",
  "Trump is set to meet with President Xi Jinping of China in Osaka, Japan, on Saturday — American chip executives and others said lasting damage had already been done.",
  "Trump is known to like Ms.",
  "“Mr. Trump is ticking all the boxes, basically: China done, Japan alerted and now India,” said Harsh V. Pant, a professor of international relations at King’s College London. “With this decision, Mr. Trump is getting into election mode.”",
  "“Jaishankar is going to try to cut a bilateral deal with Trump,” Mr. Chaulia predicted. “The problem with Trump is that no deal is a done deal.”",
  "Trump is expected to produce little more than a fragile truce in the trade conflict, and probably the start of a new round of talks, so Mr.",
  "Trump is to make headway on a truce in the trade war that has helped drive a slowdown in Chinese economic growth.",
  "“If Canada upholds the California standards, it could really shift the market away from what Trump is trying to do — it could make it so that auto companies don’t want to play with Trump on this anymore,” said Christopher Sands, the director of Canadian studies at Johns Hopkins University.",
  "Trump is re-elected, he could choose to appoint a new Fed chief.",
  "Trump is appealing the rulings.",
  "Trump is heading into the thick of a re-election campaign that will determine the fate of his presidency.",
  "Trump is mindful that he needs to be in the state early and often.",
  "“President Trump is playing a dangerous game. It is not in anyone’s interest to do what he’s thinking of doing — including his own,” Mr. Conti-Brown said, adding: “History has proven time and again that when we give politicians the power to set the value of money, they do it badly and the consequences can be catastrophic.”",
  "Trump is expected to meet with President Xi Jinping at the Group of 20 nations summit in Japan.",
  "WASHINGTON — President Trump is pressing allies to join the United States in creating a fleet of warships to protect commercial oil tankers from attack by Iran in the Persian Gulf and nearby waters, despite alarm from some within the Pentagon that the mission could escalate into the kind of direct confrontation Mr.",
  "Trump is seeking to avoid.",
  "Trump is seeking to avoid.",
  "Trump is getting in return.",
  "Trump is meeting in Osaka with President Xi Jinping, but that is already weighted by their  tense trade dispute , with more tariffs hanging over the discussion.",
  "Trump is waging — have forced it to open the door to a cut.",
  "Trump is correct that the Fed’s rate increases were meant to slow the economy.",
  "“I don’t think the Fed can ever sit back on its achievements and feel comfortable,’’ said Mark Spindel, founder and chief investment officer at Potomac River Capital and the co-author of a book on politics and the Fed. “Trump is trying to foam the runway in case there is a slowdown.”",
  "Trump is urging, he has redoubled attacks on the central bank.",
  "Trump is eager for a resolution to the longstanding dispute, seeing it as a signature element of the legacy he hopes to forge and a potential boost to his re-election campaign.",
  "“Even for a country like Poland that has done everything possible to establish a friendly and constructive relationship with Trump, including purchasing F-35s, the message from Trump is clear: ‘The United States is unwilling to do more for your security.",
  "Trump is narrowly focused on  cutting the trade  deficit with China, which many economists say is not meaningful.",
  "Trump is also aware that his signature campaign promise — to build a wall along the border with Mexico — has not come to fruition.",
  "Trump is turning 73 this week) and noted that he was part of the Washington establishment, giving Mr.",
  "“President Trump is always strongest when he has a direct foil,” Mr. Miller said. “I can’t imagine him not taking advantage of the opportunity to jab at Biden.”",
  "Trump is repurposing some of his most effective ad hominem attacks from the last election.",
  "Trump is through  a formal impeachment inquiry .",
  "Trump is popular in this part of the country, unlike in Britain or other parts of Ireland.",
  "Trump is then scheduled to fly to South Korea to meet with its president, Moon Jae-in, who is urging Mr.",
  "Trump is relatively unpopular in Britain, but the president dismissed those claims, saying that coverage of the protests was overblown.",
  "Trump is also expected to meet with another Tory leader on Wednesday: Michael Gove, the environment minister, who is also a candidate to replace Mrs.",
  "Trump is unpopular around Britain, and especially in London.",
  "“We want to show the world and Trump that this is not O.K. and Trump is not welcome.”",
  "Trump is expected to continue pressing his “America First” agenda.",
  "Trump is also expected to have notable sit-downs with other leaders.",
  "Trump is expected to decide after that meeting whether to impose additional tariffs on China.",
  "Trump is said to irk him.",
  "under Ronna’s leadership has done historic work and President Trump is well served with her at the helm,” he said.",
  "Trump is right to be worried.",
  "“It’s obvious that on a long-term perspective, President Trump is willing to effectively weaponize tariffs,” said Wen Lu, a rates strategist at TD Securities. “I think he’s almost using this as a political message to reinforce his stance against China.”",
  "Trump is succeeding only in creating maximum pressure among hard-line factions in Iran to respond with carefully calibrated attacks that send a message, like those against tankers in a vital passageway for global oil supplies.",
  "“From Kim’s perspective, Trump is still the best possible president to make a deal with, since it is highly unlikely that the next U.S.",
  "“Trump is not risk averse,” said James Jay Carafano, a foreign policy expert at the Heritage Foundation who advised Mr. Trump during the transition. “He is perfectly willing to use force. He is not afraid about getting into an escalatory conflict, but his use of force is calculated, and he predetermines he is not going to get on an escalatory path.”",
  "“All the personnel reshuffling won’t make a difference unless they adopt a new strategy,” said Douglas Rivlin, the communications director for America’s Voice, a pro-immigration think tank. “Giving Homan or anyone else a new title will not change the fact that Trump is failing and floundering on immigration.”",
  "Trump is a full-time occupation in Washington, and in no other circumstance is faith in a president’s word as vital as in matters of war and peace.",
  "“It is so embarrassing that our government has invited this fascist buffoon back to our country and is giving him the royal treatment, pulling out the red carpet and wining and dining him with our tax money,” she said. “We want to show the world and Trump that this is not O.K., and Trump is not welcome.”",
  "“Donald Trump is an open racist and sexist, a volatile and dangerous character who seems set on taking the West into further wars,” said Maz Saleem, an activist and member of the Stand Up to Trump protest group.",
  "Trump is scheduled to attend events commemorating the 75th anniversary of D-Day.",
  "“There is no doubt that the tenor on immigration has shifted in the last couple of years, but it sounds really different because Trump is being so extreme on his policies,” said Lanae Erickson, a senior vice president at Third Way, a centrist Democratic think tank based in Washington.",
  "Trump is feeling any fresh unease about  Ms.",
  "Trump is to tell him they are spending money in the United States.",
  "Trump is famously focused on numbers as affirmation — the larger the better — and he has recoiled at suggestions that he is struggling in a general election matchup.",
  "President Trump is in Britain for a state visit and on Monday,  he met with Queen Elizabeth II at Buckingham Palace , where she presented him with a surprising gift.",
  "Trump is likely to be gone by January 2021, it may seem advantageous to slow-walk him on points of contention in hopes that whoever comes next will be more reasonable, in their view, or at least more predictable.",
  "Trump is planning sessions with Mr.",
  "Trump is just threatening more tariffs as a negotiating tactic, and deals will be struck before the most onerous levies go in to effect.",
  "Trump is once again mixing projects to replace existing barriers with construction of entirely new sectors of a wall along the southwestern border — and inflating the mileage.",
  "Trump is putting the Fed’s chairman, Jerome H.",
  "“Donald Trump is an embarrassment who lacks any kind of dignity and has interfered outrageously in our national affairs,” John Simpson, a prominent correspondent for the BBC tweeted on Monday. “BUT he is the (temporary) leader of our close friend and ally, and we owe it to the US to put up with him as best we can.”",
  "“I would argue that Trump is more royal than the queen, he behaves more like a potentate,” he said, adding that Mr. Trump had an “ostentatious type of living, whereas the British royal family are known for their parsimony. The queen famously collects string, and eats her breakfast out of Tupperware.”",
  "“To get Netanyahu re-elected, Trump is clearly now willing to take instructions from him,” said Martin S. Indyk, a former American ambassador to Israel. “I believe Netanyahu will return the favor by arguing forcefully to American Jews and evangelical voters that they should vote for Trump because he’s the best friend Israel has ever had.”",
  "Trump is said to be particularly taken with the idea because it fits with his “America First” approach.",
  "Trump is surrounded by conservatives in the White House, such as his acting chief of staff, Mick Mulvaney, a former Tea Party congressman who has no appetite for raising the gas tax to pay for an infrastructure bill or to make businesses swallow a minimum-wage increase.",
  "Trump is moving to close a side door opened by Democratic lawmakers in his home state by asking a judge to declare that the Ways and Means Committee “lacks a legitimate legislative purpose” to request his state tax returns.",
  "“Let me be clear: Donald Trump is a disgusting, filthy, petty racist and he is trying to start a race war in this country and what we saw this week is just the beginning,” said Ms.",
  "Trump is a product of his place and time, born and raised in the Queens of another era.",
  "“We will survive, we will prosper, long after President Trump is gone,” he said. “Our time slots are in millennia.”",
  "Trump is now pushing Mexico and Guatemala to do the same.",
  "Trump is using overt hostility to immigration and appeals to racial resentment to explain the same approach, it may make the costs and trade-offs of those policies more difficult to ignore.",
  "Trump is unusual only in that he is openly and deliberately driving to upend that system.",
  "Trump is wrong about that.",
  "On Thursday, President Trump is assembling a group of his most ardent online supporters for a White House “social media summit.” The guest list has not been publicly released, but a motley grab bag of pro-Trump influencers have taken to Twitter to brag about their invitations, including James O’Keefe, the right-wing founder of Project Veritas; Bill Mitchell,  a pro-Trump activist  who has promoted the QAnon conspiracy theory; and a pseudonymous Twitter user, “CarpeDonktum,” who is perhaps best known for  creating a doctored video  of former Vice President Joseph R.",
  "Trump is trying to work the referees ahead of the 2020 election, and intimidate social media companies out of enforcing their rules.",
  "Trump is known for spontaneously dialing up his supporters, and even the occasional Democrat.",
  "“All of a sudden, these people who had no vehicle to express these attitudes are now being invited to express them,” said Lynn Vavreck, a political scientist at U.C.L.A. and occasional Upshot contributor, and a co-author of a book with Mr. Tesler and John Sides on  the role of racial identity in the 2016 election . “Trump is a huge element in what’s going on. He’s insufficient, but he’s necessary. The voters are not sufficient but they’re necessary.”",
  "Trump is scheduled to deliver his Fourth of July speech from the steps of the Lincoln Memorial, becoming the first president in decades to participate in the annual Independence Day event.",
  "Trump is unlike any other politician I’ve ever fact-checked,” Ms.",
  "About half of registered voters believe President Trump is racist, according to a new national poll released Tuesday, which showed voters are sharply divided along partisan lines on the question.",
  "Trump is racist while 45 percent do not.",
  "“Trump is working to make Muslims, immigrants, refugees and people of color feel afraid because he’s afraid of our collective power, and he’s emboldened white nationalists in the process by making the conversation about who belongs here and who doesn’t,” Ms. Mohammed said. “Welcoming Ilhan back home to Minnesota today was to remind those same people and Trump that we are all here to stay, and that we’re damn proud of our congresswoman.”",
  "“It’s also on my side of the aisle, the danger of using blanket stereotypes and generalizations for all people inside agencies when Trump is the president,” she said. “I can’t tell you how many times I’ve heard people say all Border Patrol agents are bad, and if there’s any good ones left, they should quit.”",
  "“If Donald Trump is the kind of Jesus of the disenchanted, displaced non-college white voter, then Perot was the John the Baptist of that sort of movement.”",
  "Trump is in Washington and Mr.",
  "President Trump is facing criticism over his taunts directed at four minority congresswomen,  telling them to “go back” to their “totally broken” countries .",
  "Trump is clearly hoping that his British doppelgänger will share his instincts on these issues.",
  "Trump is expected to continue dangling a potential free trade agreement with Britain to encourage Mr.",
  "Trump is the 10th president since Kennedy to put his stamp on the space program and the latest to aim for the stars with more brio than blueprint.",
  "Trump is now approaching North Korea in the same way Mr.",
  "Trump is not the first to take Ms.",
  "Trump is the first to turn the garden into a well-manicured mosh pit.",
  "“I agree with the chairman this morning when he said Donald Trump is not above the law.",
  "“The reason, again, that you did not indict Donald Trump is because of the O.L.C. opinion stating that you cannot indict a sitting president, correct?”",
  "Mueller III would show the nation that President Trump is unfit for office — or at the very least, severely damage his re-election prospects.",
  "“Donald Trump is not above the law,” Representative John Ratcliffe, Republican of Texas, told Mr. Mueller, “but he damn sure should not be below the law.”",
  "“I’d like to ask you the reason, again, that you did not indict Donald Trump is because of the O.L.C. opinion stating that you cannot indict a sitting president, correct?”",
  "WASHINGTON — President Trump is sending a high-level delegation to meet with Russian counterparts in Geneva this week to  pursue an arms control treaty  that for the first time would cap the nuclear arsenals of not just the two largest powers, but China as well.",
  "Trump is president himself, and he has written off this entire city as a  “disgusting, rat and rodent infested”  place where  “no human being would want to live,”  and is blaming its longtime and revered congressman, Representative Elijah E.",
  "“Trump is a buffoon. He looks at this as an African-American community, and that’s all he sees. That’s where his narrow mind is,” said John Cheatham, 66, who said he covers murder trials for a local radio station, adding, “If you had a Mount Rushmore of hate, he would be on it.”",
  "Trump is aware he is being filmed, as he smiles and embraces a blond woman on the dance floor.",
  "Trump is currently on pace to increase discretionary spending by an average of nearly 4 percent per year.",
  "WASHINGTON — As he tries to tackle the  greatest challenges  to American power in Asia, President Trump is overturning policy toward China and North Korea that for decades was as canonical as Confucian ritual.",
  "“The disgust with Trump is so overwhelming,’’ he said. “It’s not going to be the Hillary deal in 2016.”",
  "Trump is racist, but voters are sharply divided along partisan lines.",
  "Trump is continuing to throw uncertainty into a global economy that is already struggling with weakened demand from China and a slowdown in manufacturing.",
  "“This is really about character and values as opposed to issues and ideology,” says Mike Donilon, Biden’s chief strategist. He acknowledges that Hillary Clinton tried and failed to make Trump’s suitability the pivotal question of the 2016 election. The difference this time, he says, is that Trump is now president and has demonstrated his inadequacy. Biden made a similar point. “Even when he was running,” Biden told me, “I don’t think anybody thought he would be as bad as he is.”",
  "But among respondents who were satisfied with the economy, Trump is at 55 percent, while 41 percent disapprove of his performance.",
  "Trump is assailing the very idea of what it means to be an American, among them Mr.",
  "“Mr. Trump is a man of action,” Mr. Ahmadinejad said in a lengthy telephone interview with The New York Times. “He is a businessman and therefore he is capable of calculating cost-benefits and making a decision. We say to him, let’s calculate the long-term cost-benefit of our two nations and not be shortsighted.”",
  "“I agree with the chairman this morning when he said Donald Trump is not above the law,” Mr. Ratcliffe said. “He’s not. But he damn sure shouldn’t be below the law.”",
  "“We will survive, we will prosper, long after President Trump is gone,” he said, pointing to what he called “7,000 years of proof” of Iran’s survivability.",
  "To be uninvited to a dinner or a meeting with Ivanka Trump is not very serious, said Mr.",
  "President Trump is not likely to authorize a change that would increase the unemployment rate on his watch simply by altering the rules the Labor Department uses.",
  "Trump is going after members of the majority party in the House, capable of fighting back.",
  "“To a certain extent, the electorate already gets that Donald Trump is racist and he says racist, offensive things, so of course, you have to condemn what he says as a matter of principle,” Mr. Belcher said. “But from a strategic standpoint, does it get you anything to fall into where he clearly wants the battle to be fought? It’s almost like he’s picking the battlefield for 2020.”",
  "“He’s framing the election as a clash of civilizations,” said Charlie Sykes, a conservative writer who is critical of Mr. Trump. The argument Mr. Trump is making is both strategic and cynical, he said. “They’re coming for you. They hate you. They despise America. They are not you.”",
  "Trump is tracing a path to re-election that runs through Pennsylvania, Michigan and Wisconsin, where the four women are unpopular.",
  "Trump is trying to set the terms of his re-election fight.",
  "“Rather than let Democrats in the primaries choose his adversary, Trump is seeking to make the selection himself,” Mr. Buchanan said. And if the election is seen as a choice between Democrats like Ms. Ocasio-Cortez and Ms. Omar, Mr. Buchanan added, “Trump wins.”",
  "DETROIT — As “Robert Mueller Wednesday” overtook Washington, with the nation transfixed on the  congressional testimony  of the special counsel who investigated Russian interference in the 2016 election, Democratic presidential hopefuls laid out a different case: that President Trump is a bigot who unduly harms black communities.",
  "Trump is convinced it will help him, said people who have spoken to him in recent days.",
  "Trump is really trying to accomplish — rally the faithful while also converting nonvoters who are inclined to be sympathetic to his nationalistic appeals.",
  "“The media attention is driven by whatever Trump is talking about — and that’s what people hear, that’s what filters down, ” said Tresa Undem, a partner with the research firm PerryUndem, who has been surveying likely Democratic primary voters in recent weeks.",
  "“There’s a very real risk for Democrats that Trump is going to have the resources to define himself and our nominee in the spring before we can,” said Robby Mook, who served as Mrs. Clinton’s campaign manager in 2016. “That’s a very real risk. It should worry us.”",
  "Trump is including years of progress that took place under his predecessors.",
  "Trump is referring to the E.P.A.’s  plan to reduce childhood lead exposure , released in December 2018.",
  "Trump is racist , according to a new national poll.",
  "“Ivanka Trump is not on the National Security Council — she is not an adviser on the issues being discussed,” Michael A. McFaul, an ambassador to Russia under President Barack Obama, said of Ms. Trump’s presence. “So her presence undermines the professional look of the Trump delegation, both to other countries and to national security professionals in the Trump administration.”",
  "Trump is a racist, compared with 45 percent who said he is not.",
  "“White progressives don’t understand race in this country and conservatives and Republicans do,” he said. “But they better learn, because Donald Trump is coming.”",
  "“Part of the feral genius of Trump is that even when he has not fully thought it through, by behaving outrageously, he demands a response,” said David Axelrod, a Democratic strategist who was a senior White House adviser to President Barack Obama. “Pelosi tried to thread a needle by choosing the least disruptive response that would give the broadest number of people the opportunity to express themselves.”",
  "President Trump is  under fire for a series of tweets  about four young congresswomen of color — Representatives Ilhan Omar of Minnesota, Alexandria Ocasio-Cortez of New York, Rashida Tlaib of Michigan and Ayanna S.",
  "Trump is a Rorschach test for how Democratic candidates, activists and voters see the future — and the past.",
  "Trump is a historical comma, a four- or eight-year break from the country’s political baseline.",
  "“Trump is very much a symptom of our problems, not the cause,” Senator Michael Bennet of Colorado said in an interview earlier this month. “People thought, ‘We couldn’t do any worse, we might as well blow the place up.’",
  "“China and other nations have not played by the rules for a long time, and President Trump is the first president to stand up to them and send a clear message that the United States will no longer tolerate unfair trade practices,” Agriculture Secretary Sonny Perdue said in a statement. “The details we announced today ensure farmers will not stand alone in facing unjustified retaliatory tariffs while President Trump continues working to solidify better and stronger trade deals around the globe.”",
  "Trump is betting his presidency on his ability to inflame those divisive issues, and his actions over the past week give us some hints about what to expect from his re-election campaign.",
  "Trump is to shape his chapter in the history books, he repeatedly expressed patience throughout the trip.",
  "Johnson, a scholar at the Brennan Center who has written extensively on black voters, said he was skeptical that African-American turnout would reach Obama-era levels, but noted that “if it just goes up from ’16, Trump is in trouble.” A record 66.6 percent of eligible black voters cast ballots in 2012, but that number fell to 59.6 percent four years later.",
  "Trump is “irritating” — and has been “ever since he was sworn in” — but said that’s all the more reason to show up next year.",
  "Trump is likely to push for cuts to a pair of popular retirement programs — and risk exposing himself to attacks in a re-election campaign — before a second term.",
  "“Trump is trying to kill two birds with one stone: getting China to accept any type of trade deal and pushing the Fed to cut rates,” Mr. Daco said. “It’s like shooting yourself in the foot just to get another dose of morphine. It’s not a good approach.”",
  "Trump is not the first president whose use of language has provoked ridicule and dismay.",
  "“I thank God everyday President Donald John Trump is President and that he will launch a Racial War and Crusade.”",
  "WASHINGTON — Against the backdrop of mounting evidence that the global economy is weakening, President Trump is caught between his desire to pursue the trade war with China he promised to win and his need to keep the economy humming as the 2020 election approaches.",
  "Trump is increasingly focused on ending the conflict in order to maintain his support among farmers, who have lost some of their main export opportunities as China ordered state-owned companies to stop buying American soybeans.",
  "Trump is impatient to showcase a success story to his supporters ahead of the 2020 election.",
  "“more false fabrications by people who hate the fact the status quo, that has crippled this country for decades, is finally changing as President Trump is moving quicker than anyone in history to build the wall, secure the border, and enact the very immigration policies the American people voted for.”",
  "Trump is scheduled to arrive in Ohio in the morning before traveling on to Texas in the afternoon.",
  "Trump is ignoring the view of his conservative advisers, who believe that China’s authoritarian model threatens American interests worldwide.",
  "Trump is engaged in to keep his financial records private.",
  "“it certainly doesn’t bode well for Democrats heading into 2020 that their best bet for beating President Trump is to deny millions of Californians the ability to vote for him.”",
  "Trump is also trying to appease corn farmers who complain that an Environmental Protection Agency decision this month will hamper ethanol production.",
  "Trump is required to file with the government listed the Doral resort as the Trump Organization’s crown jewel, consistently bringing in annual revenue of more than $50 million.",
  "Trump is succeeding in inflicting pain on countries he accuses of unfair trade practices, but economists warn that the pain is likely to boomerang onto the United States.",
  "“I spoke to the president today,” he said. “We discussed the best ways to prevent these types of tragedies. President Trump is a strong 2A President and supports our right to keep and bear arms!”",
  "Trump is a longtime skeptic of the United States’ 18-year military presence in Afghanistan and campaigned against expensive foreign interventions.",
  "Trump is unlikely to do Ms.",
  "Trump is comfortable abandoning the norm that the president should not explicitly pressure the Fed, Mr.",
  "Trump is the mouth, and Mr.",
  "President Trump is locked in a trade war with China, with the latest round of tariffs scheduled to take hold on Sept.",
  "Trump is  an “unfit con man”  who puts his own interests above those of the country.",
  "“I’m a conservative,” Mr. Walsh said. “I’m running because Donald Trump is not who we are. He’s the worst of who we are.”",
  "“They wanted to show that President Trump is right about Sweden,” Mr. Castillo said, “that people coming to Europe are terrorists and want to disturb society.”",
  "Trump is expected to try to draw Mr.",
  "Trump is ill equipped to provide the kind of unifying, healing force that other presidents projected in times of national tragedy.",
  "Trump is the son of an immigrant.",
  "“Donald Trump is responsible for this.”",
  "Trump is among the city’s residents.",
  "Trump is “not ever going to become president, right?",
  "Trump is trying to keep his true intentions murky.",
  "“Donald Trump believes climate change is a hoax,”  Mr. Sanders wrote on Twitter  over the weekend, while campaigning at the Iowa State Fair. “Donald Trump is an idiot.”",
  "Trump is a fool’s errand.",
  "“Donald Trump is a raging racist,” Mr. Weld said last month. “He’s a complete and thoroughgoing racist.”",
  "“Part of the reasons that voters in 2016 overlooked a lot of these same criticisms of Trump is that they hoped that his schtick was just a schtick,” said Geoff Garin, a Democratic pollster. “It’s possible these criticisms will be more meaningful because it’s much harder to have the illusion that these character deficiencies aren’t for real.”",
  "“but Ralph said in a commercial that Donald Trump is a narcissistic maniac.”",
  "“President Trump is trying to sell NAFTA 2.0,” Bill de Blasio, the mayor of New York, said in the debate as he tried to attack Mr. Biden, who voted in favor of the original deal while in Congress. “It’s just as dangerous as the old NAFTA. It’s going to take away American jobs like the old NAFTA, like it did to Michigan. And we cannot have Democrats be party to a new NAFTA.”",
  "WASHINGTON — By pushing Prime Minister Benjamin Netanyahu of Israel into  barring an official visit  by the first two Muslim women in Congress, President Trump is doubling down on a strategy aimed at dividing the Democratic Party and pushing some Jewish voters into the arms of Republicans.",
  "“You have a situation where Netanyahu is relying on Trump to help him in his re-election, and Trump is expecting Netanyahu to reciprocate,” said Martin S.",
  "China appears to be aiming its tariffs at parts of America where support for President Trump is particularly strong, like farm country in the Midwest.",
  "Trump is not fit for the job.",
  "Trump is unfit to serve, most polls show the president’s approval rating among Republican voters is consistently in the high 80s.",
  "“I’m a conservative,” Mr. Walsh says in his announcement video. “I’m running because Donald Trump is not who we are. He’s the worst of who we are.”",
  "“Trump is feeling very muscular right now,” Mr. French said. “But the next round of tariffs will hit the president’s base particularly hard. The people who voted for him in 2016 felt economically vulnerable. The tariffs will cause job losses and higher prices for everybody but especially his base.”",
  "Trump is eager to contrast the economic success of his policies with those in slumping economies like Germany and France during a session that he called for on the global economy Sunday morning.",
  "Trump is wrong to dismiss the threat to the American economy from his trade war.",
  "[Update:  Joe Walsh says Trump is unfit to be president in 2020 . Some say the same about him.]",
  "Trump is scheduled to visit in September to meet with the prime minister, Mette Frederiksen; Queen Margrethe II; and the leaders of Greenland and the Faroe Islands.",
  "Trump is a former real estate developer who tends to view his presidency through the lens of acquisitions.",
  "Trump is increasingly caught between his promise to play hardball with China and mounting pressure to keep the American economy strong heading into the 2020 election.",
  "“I think Trump is throwing Xi a lifeline,” Mr. Bannon said. “One tweet, one comment from Trump can cause the whole thing to go in a certain direction. I think he’s being very careful about unintended consequences.”",
  "“loyalty” charge, the Republican Jewish Coalition wrote, “President Trump is pointing out the obvious: for those who care about Israel, the position of many elected Democrats has become anti-Israel.”",
  "Trump is continuing his track record of getting hostages freed.",
  "“‘President Donald J. Trump is the greatest hostage negotiator that I know of in the history of the United States. 20 hostages, many in impossible circumstances, have been released in last two years,’” Mr. Trump wrote on Twitter, seemingly quoting Mr. O’Brien. “‘No money was paid.’",
  "Trump is heavily reactive to news coverage, and when he does something that he believes he should have been praised for — such as Wednesday’s visits to the cities — he grows furious when he does not receive accolades.",
  "Trump is by energizing young voters, particularly younger voters of color, through boldly progressive policy proposals.",
  "Trump is the country’s chief affliction, or a symptom of deeper woes.",
  "WASHINGTON — President Trump is expected to name John Sullivan, the deputy secretary of state, to be the next ambassador to Russia, replacing Jon Huntsman Jr.",
  "Trump is expected to lean on a range of well-heeled individuals and interests.",
  "Trump is channeling their influence when he talks up possible deals with China.",
  "Trump is famously adept at maintaining positions that seem mutually exclusive.",
  "“The simple truth is President Trump is in trouble and he knows it,” Mr.",
  "Trump is progressing quickly, and that it should be allowed to run its course before any decision is made about whether to bring impeachment articles against him.",
  "Trump is still facing pushback from gun rights advocates and some of his own advisers, and in the end, the president could repeat his pattern on other issues of abruptly dropping the idea of doing something after talking about it for weeks.",
  "“If Donald Trump is standing there,” Mr. Manchin said, “and we’ve got bipartisan senators standing beside him, and he says, ‘This is my piece of legislation and I support it wholeheartedly,’ it’ll pass. Without that, we’re back to square one.”",
  "Trump is a white supremacist.",
  "Trevor Noah has a theory: President Trump is coming up with ways to deport his wife, Melania.",
  "“Trump is not popular here, that is an understatement, but after a while, when it’s only attacks on Trump, that doesn’t feel like there’s much substance there,” Mr. Brown said in an interview. “It’s a very thin debate right now, as I see it, and for many Californians, and I’m sure many Americans, it’s not all that interesting.”",
  "“Donald Trump is malpractice personified — we’ve got to point that out,” John Hickenlooper, the former governor of Colorado, said Tuesday night. “Where’s the small manufacturing jobs that are supposed to come back?”",
  "Trump is prepared to impose new rounds of tariffs on imports from China in September and December, which would affect a large batch of consumer goods, and he has threatened to impose tariffs on imported automobiles next year.",
  "Trump is being urged on by Robert Lighthizer and Peter Navarro, his trade advisers, who generally share the president’s hostile view of China and who advocated a confrontational path with tariffs.",
  "“Trump is essentially confirming the seemingly inevitable escalation of the trade war that seems in prospect, given the gulf in negotiating positions and the broken trust between Chinese and U.S. negotiators,” said Eswar Prasad, the former head of the International Monetary Fund’s China division. “Both sides now seem to be settling in for a broad and unremitting trade war that will last at least through this term of Trump’s presidency.”",
  "Trump is fundamentally like any other president.",
  "Trump is deeply unpopular, and opinions of his presidency are entrenched.",
  "“By failing to act and assume leadership in the region, Trump is allowing nations with long, complicated histories to fall back into traditional rivalries,” said  Jean H.",
  "Trump is at Camp David, personal phones are taken away from his aides for security reasons upon arrival, but Mr.",
  "“Trump is a different category,” Mr. Zelizer said in an interview, “in that it’s not even that he’s not doing enough or the right thing. It’s almost as if he doesn’t want this role at all, and he has no interest in stopping his traditional, normal tweet storms.”",
  "Trump is expected to return to his namesake Fifth Avenue skyscraper on Sunday night for the  United Nations General Assembly .",
  "Trump is wrong that other countries do not contribute to Ukraine’s efforts to counteract Russian aggression in recent years.",
  "Trump is violating the so-called emoluments clause of the Constitution by accepting foreign government funds.",
  "As for China’s “worst year,” President Trump is most likely referring to economic growth.",
  "Trump is visible at this point.",
  "WASHINGTON — President Trump is strongly considering a plan to revoke California’s legal authority to set state tailpipe pollution standards that are stricter than federal regulations, according to three people familiar with the matter.",
  "Trump is a longtime user of the Sharpie pen, whose thick, bold imprint is a visual reflection of Mr.",
  "Trump is folding to America’s biggest economic competitor.",
  "Trump is deeply unpopular with most Hispanics in New Mexico , and those who do support him are unlikely to have a decisive electoral effect there.",
  "WASHINGTON — Sometimes President Trump is in the Oval Office when he talks on the phone with a president or prime minister.",
  "Trump is on a call, his national security adviser is typically either in the room with him or listening in from his West Wing office.",
  "Trump is to keep his calls brief, in part because the consecutive translation employed makes even short calls an imposition on the president’s day.",
  "President Trump is in New York, attending the opening of the United Nations General Assembly.",
  "Trump is a native New Yorker, his connection to the attacks of that day has never been particularly emotional.",
  "Trump is facing pressure to relent.",
  "Trump is asking — launch an investigation into the Bidens — but also asks Mr.",
  "“knows that as long as Donald Trump is leading the GOP he is irrelevant.”",
  "Trump is  threatening retaliation  against Iran, although it’s unclear what that means.",
  "“President Trump is prioritizing the safety and security of the American people by making sure we do not admit more people than we can vet,” the administration said Thursday evening.",
  "Trump is credited as a co-author of “The Art of the Deal,” there is little art to his depiction of the character of “The President” in “Eyes Only.” Unlike Mr.",
  "Trump is preparing to run for re-election in a bitterly divided country with polls regularly showing him receiving well short of 50 percent support.",
  "Trump is flouting.",
  "“President Trump is violating the Constitution by making money off his lavish, ritzy resort properties, ultimately prioritizing his profits over the interests of the American people,” it said.",
  "[Related:  Trump is speaking at an H.B.C.U . His allies will outnumber the students.]",
  "Trump is scheduled to visit Baltimore, where Republican House members are holding their annual retreat, on Thursday, his first visit to the city since his string of insults over the summer.",
  "“For us, the United States is not only a partner and an ally, but also a friend,” said Mr. Bukele, 38, who was dressed in a suit but, as is his custom, wore no tie. “We’re hoping that this meeting will only strengthen our relationship even more, and I think it will because, you know, President Trump is very nice and cool, and I’m nice and cool, too. We both use Twitter a lot, so, you know, we’ll get along.”",
  "“You’ve got the makings of a Trump-Pelosi alliance here on drug pricing, and that would be a powerful combination,” said Representative Peter Welch, Democrat of Vermont, who serves on the Energy and Commerce Committee. “Trump is the one who asked the practical question: Why do we get ripped off, why are we the suckers paying the highest prices in the world? Now he has an opportunity to address that.”",
  "Trump is a wild card: His administration has been discussing drug pricing with Ms.",
  "Trump is a longtime Yankees fan who watched many games with George Steinbrenner, the team’s larger-than-life former owner, and reveled in the presence of one of the franchise’s greatest players.",
  "Trump is facing an economic slowdown in the United States as the effects of his trade war with China and slowing global growth begin to rattle consumer confidence and threaten business investment, particularly in the manufacturing sector.",
  "Trump is calling the impeachment inquiry a “witch hunt,” questioning the source of an anonymous  whistle-blower ’s information, calling the  complaint  “fake,” and raising questions about whether the whistle-blower law was changed before the complaint was filed in August.",
  "Trump is setting by striking limited pacts that could leave significant issues unresolved.",
  "WASHINGTON — President Trump is sending a modest deployment of American troops to Saudi Arabia and the United Arab Emirates, along with air and missile defense systems, in response to the attacks on Saudi oil facilities, which the administration blames on Iran.",
  "President Trump is considering  a range of options  to punish Iran for  this month’s  attack on Saudi oil facilities , and has  toughened sanctions on Iran  and  ordered the deployment of additional troops  to the region.",
  "Trump is also a fickle thing.",
  "“President Trump is a master of communication and branding, and his campaign merchandise is emblematic of that,” Mr. Murtaugh said. “It gives people a little ownership of the re-election campaign and gives them high-quality merchandise in exchange for their donations.”",
  "Trump is engaged in a negotiation of his own with Iran, he will sense a chance to reach an agreement before the 2020 American elections — much as he has with North Korea.",
  "Trump is necessary .",
  "Trump is to address the world body on Sept.",
  "“It was clear from the outset that the kind of strangulation that was being applied to Iran made it impossible for any Iranian leader to give in,” Mr. Sick said. But, he added, “Iran was not going to collapse, and now Trump is clarifying his policy.”",
  "Cohn his next documentary subject than he dismissed the idea, telling himself that “it will never be financed because Donald Trump is not going to win the election.",
  "President Trump is considering making Mr.",
  "Trump is considering.",
  "“Donald Trump is a slumlord who has spent his presidency pushing people into homelessness by taking away health care, food assistance and affordable housing funds,” Scott Wiener, a Democratic state senator from San Francisco, said on Tuesday as the president arrived in the state for a series of fund-raisers and a trip to the border. “He has no credibility on housing and homelessness.”",
  "“The departure of Bolton suggests that President Trump is going to be his own foreign policy adviser,” said Martin S.",
  "“Donald Trump is terrified of Joe Biden because the Vice President would beat him like a drum,” she said.",
  "Trump is seeking re-election.",
  "Trump is said to have urged the Ukrainian president on a July 25 phone call to investigate Mr.",
  "“You should be looking at Trump,” Mr. Biden said. “Trump is doing this because he knows I’ll beat him like a drum.”",
  "Trump is now president, making the allegations that he mixed the country’s foreign policy with his political operations truly extraordinary — and maybe  even the basis for impeachment .",
  "“a slap in the face to the members of the armed forces who serve our country that President Trump is willing to cannibalize already allocated military funding to boost his own ego and for a wall he promised Mexico would pay to build.”",
  "“The biggest reason this is unworkable though is that Trump is too insecure to rest this much prestige in one adviser,” agreed John Gans, the author of “White House Warriors,” a new book on the National Security Council.",
  "President Trump is saying that Iran appears to be responsible for the weekend attacks on oil facilities in Saudi Arabia.",
  "Hoyer of Maryland, was unequivocal: An impeachment investigation of President Trump is not underway.",
  "Trump is obliged to share either the transcript or the whistle-blower complaint with Congress.",
  "Trump is to make impeachment look like a partisan endeavor, with perceptions falling along the same lines of the country’s existing political polarization.",
  "Trump is fickle about his foreign allies, but he shares common ground with Mr.",
  "“We hear we’re not ‘Tier 1’ candidates, O.K., fine,” he said. “Where the hell are you, ‘Tier 1’ candidates? They want Trump to lose in 2020, they all believe he’ll lose and they’ve made a short-term bet that we can go back to the way we were before. I have very little patience for that — the time to stand up against Trump is now.”",
  "Trump is “genuinely worried about” and offered a reminder of the lengths Mr.",
  "Trump is more important than any other policy goal Democrats might share.",
  "“Trump is successfully playing the same game he played in 2016 — and the press is falling for it again,” the memo stated.",
  "“Donald Trump is a slumlord who has spent his presidency pushing people into homelessness by taking away health care, food assistance and affordable housing funds,” said Scott Wiener, a Democratic state senator from San Francisco. “He has no credibility on housing and homelessness.”",
  "“Look, here’s the bad news: Trump is using the Oval Office to pressure a foreign power into interfering in the 2020 election,” the email said. “And it gets even worse: A new poll has us down in Iowa, a key first state in this Primary race.”",
  "Trump is simply a reflection of the ebullient general’s personality.",
  "“For Rouhani, talking to Trump is a liability,” said Ali Vaez, director of the Iran program at the  International Crisis Group , a research organization on conflict resolution. Mr. Rouhani would not take such a risk, Mr. Vaez said, unless “he knew a reward would come out of it.”",
  "Trump is an approach Mr.",
  "Trump is now going even further in his attempt to reshape the G.O.P.",
  "Trump is currently navigating, among other things,  a broiling crisis with Iran , a deadlocked trade war with China, a stalemate in nuclear talks with North Korea and the recent collapse of peace talks in Afghanistan.",
  "Trump is unappealing, especially after the midterm elections last year, when the president’s incendiary speech and divisive style saddled candidates with a brand that alienated politically crucial suburban voters, especially women and those with college educations.",
  "Trump is promoting racism.",
  "Bolton has left the Situation Room, and President Trump is left at the table with a giant set of chips set on hot spots around the world.",
  "Trump is touting isn’t the Camp David accords.",
  "Trump is playing for November 2020.",
  "Trump is not playing poker here — he’s playing solitaire.",
  "Trump is causing stress on the new government, according to a former Ukrainian official.",
  "Trump is widely popular in Israel, and Netanyahu’s campaign has adorned its party headquarters in Tel Aviv with a portrait of the two men standing together.",
  "One senior Israeli official, cracking a smile, said, “Trump is the only one who could beat Netanyahu in the election.” (Another side of the building features a similar portrait, with Netanyahu standing beside President Vladimir V.",
  "Trump is a popular, unbeatable figure.",
  "“It’s not about Trump is it?”",
  "Trump is deeply reluctant to risk an open-ended military confrontation in the Middle East that would endanger world oil supplies in the middle of a re-election campaign.",
  "Trump is often referred to as our “reality TV president,” but that obscures all the other ways he has leveraged his brand: His inherited wealth was extended into real estate holdings, WrestleMania tie-ins, books, golf, steak.",
  "Today, Trump is our novelty president, and our real one, too.",
  "Trump is trailing Mr.",
  "Trump is focused on his own interests.",
  "WASHINGTON — President Trump is trying to deflect attention from a firestorm of controversy around  revelations  that he  pressed Ukraine’s leader  to investigate a domestic political rival, former Vice President Joseph R.",
  "Trump is doing so by saying the real issue is possible corrupt activity involving Ukraine by Mr.",
  "“Trump is in a box of his own making,” said Philip Gordon, who was a Middle East adviser to Mr. Obama. “He has put in place policies — ‘maximum pressure’ on Iran — guaranteed to provoke an aggressive Iranian response, but he’s not prepared to respond aggressively in turn, and the Iranians know it.”",
  "Trump is trying to profit off the presidency, a potential violation of the Constitution’s emoluments clauses.",
  "WASHINGTON — President Trump is under intense scrutiny over a classified whistle-blower complaint about his behavior, which at least partly involves his dealings with Ukraine’s new president and Mr.",
  "Trump is said to have pressed the president of Ukraine, Volodymyr Zelensky, to investigate Mr.",
  "Trump is not known to have openly linked the aid —  which has since been released  — to his demands for political investigations, but many Democrats believe that may be the case.",
  "Trump is also trying to strike a bargain with North Korea, resolve a trade war with China and withdraw from Afghanistan after recently ending peace talks with the Taliban.",
  "A federal appeals court in New York on Friday revived a lawsuit alleging that President Trump is illegally profiting from his hotels and restaurants in New York and Washington in violation of the Constitution’s anti-corruption, or emoluments, clauses.",
  "Trump is expected to sign it.",
  "WASHINGTON — President Trump is pushing aides to find ways to curtail the growing number of homeless people living on the streets of Los Angeles, part of broader discussions his aides have held for weeks about urban problems in liberal locales, according to his personal lawyer and administration officials."
]